[
    {
        "Name": "Denny's",
        "Rating": 3.6,
        "About": "2920 S Norfolk St, San Mateo",
        "Reviews": [
            "Great food option, especially if you’re awake and hungry in the middle of the night.  Delicious multi-grained pancakes. Flavorful T-Bone steak & eggs. Freshly brewed coffee and friendly service. Wonderful! Thank you Seema B!",
            "Visited on a Saturday evening at sunset!  Two adults, two children.  We were accepted as relatives, served quickly, made a nice discount for children (despite the time)!  Delicious, fast, family friendly!  I recommend!  :)",
            "This locations has the best food and is very clean. I come alot and never is disappointed. Server Daniel and the cook Jefferson always makes this place my first choice after work when I'm hungry. Food is consistent and the service is consistent as well.",
            "Service was horrible.\nWe waited for 5-10 minutes to be greeted by a host. It was as if we were not standing there. I had to ask if we were to seat ourselves before anyone acknowledged us being there.\nAfter we sat down and finally placed our orders, our beverages were brought out.\nDespite us informing our server that there were drinks missing, we never received them.\nAfter waiting on our order for 30-45 minutes if not longer , we inquired on our order.\nWe were informed that our order would be out in 8 minutes.  After about 5 minutes of receiving that information we were told that our food would be out in 10 minutes.\nNeedless to say we canceled our order, paid for the drinks that we received even though we did not drink them and left the restaurant.\nNo apology from the Manager on duty.",
            "Everything is amazing! my family love this place, food is really good! and service is also really good."
        ]
    },
    {
        "Name": "Round Table Pizza",
        "Rating": 4.1,
        "About": "430 S Norfolk St, San Mateo",
        "Reviews": [
            "Great pizza! Great environment, had so mach fan.",
            "Although it is not quite what I ordered, after only 5 minutes you can tell it is what I should have ordered! It ended up as an Upscale Veggie add Bacon; an even wiser choice than my original. The Last Honest...almost anything around here. Go Round Table, Godspeed!",
            "Normally I like this place but recently toppings have gotten a bit sparse and pizza has been leaning towards the “over cooked” end. But they do have gluten free crusts!",
            "Place was clean. Lots of seats. Good customer service. King Arthur is always hot and good to eat.",
            "Pizza and wings were burned and didn’t gave my change back completely."
        ]
    },
    {
        "Name": "New York Pizza",
        "Rating": 4.4,
        "About": "219 S B St, San Mateo",
        "Reviews": [
            "This place is okay but there are other better pizza joints in downtown San Mateo.  I found that the dough is inconsistent as it is sometimes might be too thick or too thin.  Guess it depends on who is working there on that day.  Would that being said.  This place is located right next to a bar where you can take your pizza inside.",
            "Solid thin crust New York style pizza. Great single slice option such as pepperoni and cheese for @$7.00.  Likely the best pizza option in downtown San Mateo.  Single slices are huge!  They have large size pies as well.  No parking in front of store as roadway has been block for pedestrian traffic only. Ample parking in structure nearby.  Seating inside is hot but outside tables available.",
            "Great local pizza joint for giant slices made to order. They are open late and always take care of their customers. Bonus being next to a bar! If you ask they will bring the pizza next door for you to enjoy with a nice cold beer.",
            "Authentic new york style pizza.. this place is so good. I cannot recommend it enough. If you are craving a New York style pizza the single slices were pretty big and each bite was flavor packed.",
            "The Marriott gave me their menu. I ordered a delivery pepperoni and mushroom pizza and a Greek salad with Italian dressing. Y’all- this was delicious pizza. The dough is super good. I’m visiting from the the southeast and this pizza is great. The Greek salad was fresh and big. The cucumbers, tomatoes etc were fantastic. It should be given that salads are fresh, but in my experience it’s not!\nHighly recommend!"
        ]
    },
    {
        "Name": "Mountain Mike's Pizza",
        "Rating": 4.2,
        "About": "154 S B St, San Mateo",
        "Reviews": [
            "Best pizza in the area, customer service was exceptional. I’m pretty critical but the vibe and food was so worth it. Tuesday is 40% pizzas too, can’t beat it.",
            "Good old fashioned pizza buffet. Childhood nostalgia\n\nLots of selection of hot pizza. Salad bar was good, toppings fresh and good spinach and romaine. Vegetarian options could have been more clearly labeled. They opened recently so everything is really clean\n\nBig screen TVs. They have Soul Calibur",
            "We came in when they are about to close and Deepak welcomed us with such a positive attitude. I know how it’s like when you’re closing and people order late but we were really hungry and he really took great care of us. I love when workers love what they do and it such shows!! This guy deserves a recognition.",
            "First off I love mountain mikes pizza! I dropped in 15min before closing and Deepak was so willing to accommodate us. Thank you so much for serving us, most restaurants would probably turn you away due to the time, but he welcomed us with open arms! Appreciate the great customer service Deepak, and making sure we didn’t feel like a inconvenience!",
            "Fix the website ASAP. My family loves the pizza, but you can’t order online! It’s been broken for months. You enter all of your information and then it fails - and instructs you to call in your order. So frustrating! Also frustrating that I explain the problem when I call and management already knows that it’s broken. If you don’t intend to fix it, then disable the function! You’re losing customers without even realizing it. We won’t order from this location again unless online ordering is fixed."
        ]
    },
    {
        "Name": "Par 3 at Poplar Creek",
        "Rating": 4.5,
        "About": "1700 Coyote Point Dr, San Mateo",
        "Reviews": [
            "Nice location for a special event, or just for a casual family & friends brunch. Food items such as mushroom risotto, broiled salmon, and chocolate cake were all very tasty, and the service was attentive and efficient. Plenty of parking, but it can get a bit busy with the golf carts whizzing around.",
            "The Par3 Restaurant at Coyote Point Golf Course Club offers a delightful dining experience. The standout dish, the Pork Belly Burger (Blue Shroom Burger), is a savory masterpiece that combines the rich flavors of pork belly with the unique twist of blue shroom. The handmade Bloody Mary adds a refreshing kick to the meal, making it a perfect pairing. The scenic golf course views enhance the overall ambiance, creating a memorable dining outing.",
            "Food was really good and flavorful and came out very quickly. We especially enjoyed the Brussel sprouts and calamari- they both had great flavor and consistency. Service was quick and kind. So fun eating at the edge of the golf course- outside seating was well kept! Wheelchair accessible not many kid friendly options.",
            "My Aunt recently celebrated her birthday here. Great food. Great customer service.  Everyone was so friendly.  I enjoyed my experience here and will definitely come back to check out the bar!!",
            "First time here. Enjoyed the myself.  Scheduled entertainment wasn't there, but the band that was there was very good.  Lots of dancing and happy people. Good food and a very yummy drink."
        ]
    },
    {
        "Name": "SaltYard Restaurant and Bar",
        "Rating": 4.3,
        "About": "322 Lorton Ave, Burlingame",
        "Reviews": [
            "I was honestly heading to another restaurant when I stopped to view the menu. Two ladies walked out the door past me and were praising the friendly service.  A couple of menu items caught my eye and I decided to give SaltYard a try. I am extremely happy I did. As usual,  I sat at the end of the bar and was greeted by a pleasant young bartender named Dodo who seemed generally pleased to be there. He made an excellent drink and was very attentive to the entire bar. His smile, happy attitude, and respectful service was infectious. I went with the Ceasar salad to start. It was good. What was better was when half way through the bartender asked to let me know when I was ready for my main course. Too many restaurants lately want to turn seats or be done near the end of the night. Here, I was able to take my time and take a pause before my main. I could have just as easily asked him for it quickly, but he graciously allowed me to choose my speed. I went with the seafood risotto which was excellent!! He suggested the house made Sticky Toffee for dessert which paired great with a Port. Again, excellent!! I will definitely visit again next time I am in town.",
            "My absolute favorite was the fried calamari with artichokes. I did not like the shrimp and scallop appetizer. It was the small scallops. I was hoping for pan fried larger scallops. The drinks were great. Always love checking out the kind of concoction they make for cocktails. Truffle fries were great. Wished the truffle ravioli had more truffle flavor. The seafood on the pasta and the risotta had large shrimp and other seafood but I prefer fresher seafood. Cesar salad was good but some more anchovies would have made it perfect. Cheesecake and chocolate lava cake were moist and tasty. The sugar in the creme Brulee was great. Great ambiance and nice Street to walk around.",
            "Cute spot with great food. Bar is nice and has a decent amount of seating. They have some wine flights you can get here. I had the Bolognese which was out of this world delicious and had a small bite of the skirt steak which was also super yummy. Definitely will be returning.",
            "Great experience! My boyfriend and I came here while we where visiting his mom. It was a random hour, like 4pm and the service was amazing, food was so good. We got soup and gnocchi and shared the they even split it for us. We loved it!",
            "Lovely restaurant. Loved the food, service and ambience. Recommend.\nI ordered sea bass that was great but it could have been served with something more interesting than just a pile of ordinary salad.\nMushroom bruschetta and lamb tacos were delicious."
        ]
    },
    {
        "Name": "Jack in the Box",
        "Rating": 3.5,
        "About": "555 E 3rd Ave, San Mateo",
        "Reviews": [
            "Look I know it’s just a fast food restaurant so I’m not expecting the moon but the service was terrible. The young lady at taking our order had the enthusiasm of a death row inmate. She didn’t confirm our order or even ask what size we wanted she just put it in. The we get our food and the “large” curly fry is not only half empty when I get home I realize they put regular fries at the bottom because they didn’t have enough. Instead of making more they just gave us a half empty box with regular fries at the bottom. I’m not surprised the line was empty with this type of service. And the “bacon strips” on the sandwich were a joke. Safe to say I will never go back. I’m surprised we even got the items we ordered.",
            "Is your average Jack in the box.  Conveniently located in downtown San Mateo and open 24 hours a day.  This spot is perfect for late night munchies or any on-the-go meal.  I personally love the egg rolls 😋.",
            "The ppl were nice, helpful and had a good attitude thru the ordering process,\nThe food didn't take to long like other places,\nThe food was great an tasty.",
            "The meat was hard and dry as hell as if the meat had been sitting all day I didn’t notice until I got back to work but the cashier had wonderful customer service",
            "I ordered an extreme sausage combo sandwich.  The sandwich appeared to be reheat.  The sausages razor thin not plump The hashbrown was lukewarm.  Now is 2 hours later.  I am having my second diarrhea.  So you tell me how many stars."
        ]
    },
    {
        "Name": "Taco Bell",
        "Rating": 4,
        "About": "1975 S El Camino Real, San Mateo",
        "Reviews": [
            "My first time at a Taco Bell. Menu features both Non-veg and veg option. Ordering is via touch screen kiosks only. It seems to be relatively easy to order. The orders get filled up typically within 10 minutes or so. Our party of 4 has no difficulty finding a table. The Nacho with toppings was good. As were the chalupas and soft tacos. I may come back for breakfast just to check out what they serve.",
            "Well, since I went In and had no communication with any employees because it's just a bunch of screens that scream out welcome to the future of Taco Bell. Use the computer screen to order yourself and pay and then we will hand you your food if you can complete this task on your own. A little bit irritating. Because fast food workers are making what? $15 to $20 bucks an hour. They actually get paid to be trained for the job. So the way I see it. I spent like $25 bucks. I should receive a discount for my wage at least. So my total should have been $5 bucks. Now on the plus side by me placing my own order I didn't hear, \"We don't serve that anymore.\" and for the first time in a very long time, my order was actually correct. I think I have a real future here. Lol. I'm waiting to walk in next and have them tell me I have to cool my food as well. I just really think if you're having me do your job, Taco Bell! at least pass on. The savings and start lowering your prices to reflect that you just saved $20 bucks an hour having me check myself out. Seriously.",
            "They forgot my Large Pepsi in an Uber Eats order. The FIRST ITEM ON THE RECEIPT. 5 dollars of UE credit wont get me a new drink if I order again. Such a pain.",
            "Unfortunately, as much as I love Taco Bell I will never eat at this location again. Twice I have been served rancid food. The tortilla in the Mexican Pizza was rancid. I have actually had rancid food two other times from other Taco Bells from other items. The worst part is by the time I discover the food is rancid I'm on 15 miles away and turning back is a worse inconvenience than just tossing out the food.",
            "Taco Bell we went to had no drive-thru it was very small and when we ordered our meal which was a protein bowl we didn't get enough utensils and didn't feel like going back inside to get them because we were in a hurry there was one napkin between the two of us but the protein bowl was very good"
        ]
    },
    {
        "Name": "Taco Bell",
        "Rating": 4,
        "About": "500 E 4th Ave, San Mateo",
        "Reviews": [
            "Customers are no longer allowed to order at the counter, they're sent to order at two tablets at the store, there's been a gradual reduction in customers. Taco bell has made a big mistake in instituting their new policy, not allowing customers order at the counter, it's not fairing well with the Latin community, since the older Latino generation aren't familiar using a tablet, it's very confusing to place an order, especially during lunch hour, long line waiting to order through the two tablets on the premises, there's a slight similarity to AB 'Budlight Fiasco, having trouble regaining their customers back. Taco bell have shot themselves in the foot, and didn't realize it, til it's too little too late, Well-maintained premises, plastic shield between cashier and customers, friendly customer service, conveniently located at the corner of Claremont & 3rd St, San Mateo, CA",
            "The staff is very friendly but they short sold me on my single purchase. They forgot my extra cheese and chicken, and ran out of beans and didn’t let me know. I’m still hungry after spending $10 on a power bowl full of basically lettuce.",
            "Open late and fast service, as you would expect from a taco bell. They now have two auto service kiosks for ordering at that feel fairly removed and not welcoming, but that seems to be the standard of all fast food places now to have these. The food was not great, but as you would expect from a taco bell. Prices are very cheap for the area.",
            "Best tbell experience I've ever had. They are consistent, and I have never had any issues with my orders. Friendly and fast",
            "It's fine and all, it's just Taco Bell, but THERE'S NO DRIVE-THRU which is deeply disappointing at midnight when you have to go into a building."
        ]
    },
    {
        "Name": "McDonald's",
        "Rating": 3.8,
        "About": "1420 El Camino Real, San Mateo",
        "Reviews": [
            "Convenient location, near the 92 and 101. Easy to get food if you order through the app, but if you want to order in person during lunch/dinner rush hours, there is always a line. Parking is usually no issue, as there’s a decent free parking lot. However, there is no drive-thru, and the traffic on El Camino could complicate the entry/exit process.",
            "Good hot coffee here, I love their services, friendly staffs. Thank you and smiles from them are the warm welcome. I didn’t try the foods yet. I need just some hot coffee this time and for this cold and rain day in San Mateo. This McDonald’s is a big stand alone with a big parking lot also they are always busy.",
            "In short,\nIt would have not been my first one to stop at asking El Camino (between milbrae & 92). But after this visit I will even recommend to others to stop by this one versus other ones on El Camino in that mentioned area.\nThings have changed, it's noticeably BETTER .",
            "I recently had an experience at McDonald's that was far from the quick, tasty meal I was hoping for. After braving a crowded restaurant that smelled like a mix of old fryer oil and too-strong cleaner, I placed an order for a Quarter Pounder with cheese. The place was chaotic, and it was clear from the get-go that my burger might take a while. Sure enough, after a 20-minute wait filled with mix-ups and forgotten orders, mine finally made it to me. But the disappointment was just beginning.\n\nThe bun on my Quarter Pounder was inexplicably soggy, as though it had soaked up all the humidity in the room, and the patty was a sad sight: overcooked yet somehow still lukewarm. The cheese, which I had been looking forward to, hadn't even properly melted and just sat there, cold and uninviting. To top it off, the fries were just as lackluster - lukewarm and barely seasoned.\n\nIt was a meal that somehow managed to be both unremarkable and entirely unforgettable, for all the wrong reasons. It led me to make a swift exit and resolve to steer clear of this particular McDonald's location in the future. Definitely not the fast-food experience I was craving.",
            "Inside only or curbside, i went in took few min as expected, note - no drive thru so just stand in line for 5mins which isn't a biggie 4 me"
        ]
    },
    {
        "Name": "Limón",
        "Rating": 4.4,
        "About": "1101 Burlingame Ave, Burlingame",
        "Reviews": [
            "This place is amazing, every dish was near perfection, though the empanadas and the tuc tuc could be improved, they were slightly under flavored.\n\nI highly recommend the pork belly fried rice, it was so delicious and the pork we're cooked over long time making it crispy and packed with flavor.",
            "The portion of the food was big, they gave you lots of beef for one dish. I liked my lomo saltado, good flavor with nice rice. I am not a big fan of soaked in sauce fries, it will be better if the rice was at the bottom of my dish. The garlic bean was so delicious!\nService was great! Drinks are creatively good.",
            "Finally got to check this place out! We (party of 2) came for dinner on Friday and was seated right away despite having no reso.\n\nThe service here is really good and our waiter was very attentive. Despite being busy he always promptly filled our water.\n\nWe got the ceviche limon, quarter chicken, pork belly fried rice, and mango panna cotta.\nCeviche limon: it has 2 scallops, shrimp, red snapper, and crispy calamari. We got taro chips on the side. Everything was really yummy and I like that there’s sweet potato and corn that adds to the flavor.\nThe half chicken was slightly disappointing. The meat was not very juicy and not tender. We got the chifa vegetable and I felt it was too salty and could’ve been better\nThe pork belly fried rice was quite nice, they give four pieces of pork. The pork is crispy, tender and flavourful.\nMango panna cotta was also very delicious, highly recommend. It’s sweet but not too sweet, and the strawberries are a nice touch.\nThey also have yummy cocktail but they are on the sweeter side.\n\nAll in all would come back again, it’s a little pricy but I enjoyed most of the things we got.",
            "During the COVID period, I visited Limon Restaurant’s San Francisco location and was impressed by the delicious and well-cooked rotisserie chicken. This positive experience led me to try out their Burlingame location last weekend. Unfortunately, my recent visit left much to be desired.\nI ordered empanadas, ceviche, Arroz con pollo, and Arroz con mariscos. While the ceviche was fresh and delicious, the empanadas were just okay. However, the Arroz con mariscos lacked flavor compared to their other locations, and the Arroz con pollo was outright disappointing. The chicken was undercooked, and the rice was overly greasy, prompting me to return the dish after just two bites. Shockingly, I was still charged for it.\nThe restaurant’s atmosphere is lively, and the staff are fast and efficient. However, I was not pleased with their attitude towards complaints about the food.\nOverall, my recent experience at Limon Restaurant in Burlingame fell short of expectations, and I left feeling dissatisfied.",
            "Delish!  Nice place to try Peruvian fare.  Atmosphere is lively.  Staff were friendly and efficient.  Our server took the time to explain the menu and recommend dishes to our group.  I recommend.  Parking can be difficult during the weekends."
        ]
    },
    {
        "Name": "Jack's Restaurant & Bar",
        "Rating": 4.4,
        "About": "1750 S El Camino Real, San Mateo",
        "Reviews": [
            "We came here once for brunch and once for dinner. It gets quite busy during peak brunch time, but the restaurant is huge and we were seated very quickly.\n\nThey have a huge menu with a Greek influence. I really enjoyed their gyros and lamb burger. Gyros had warm toasted pita bread which went really well with the meat and cucumber. The sauce was a perfect amount. Lamb burger is super flavorful and something I’ve never tried before. We followed the waiters suggestion on the recommended doneness and it was really good. Their breakfast hash is also a winner - perfectly crispy on one side and soft on the other.\n\nI got their strawberry cooler mocktail which was way too sweet and difficult to drink because they did not balance the sweetness with any other flavor.",
            "We have enjoyed Jack’s food for many years now. Great for either dining in or take out. Staff is always courteous and efficient, and the large menu makes it easy for every family member to find something they like. Large parking lot with plenty of parking.",
            "Had a very nice evening at Jack's. We were seated right away. Nolan's service was excellent - very nice and attentive. Food was great and came out quickly, even though the restaurant was quite busy.",
            "Ate here on our layover in San Francisco. The food was delicious and large portions. Great atmosphere and staff. Daughter kid meal was spaghetti and huge meatball. I had the fried chicken on the early bird meals, highly recommended.",
            "It was my first time there and I'll definitely be returning. High ceilings and plenty of room for large or small parties.The food AND service was AMAZING. I don't remember the pasta name I got but it was really good. The calamari appetizer was fantastic. This is the first restaurant I've been to where they actually know how to cook salmon. The server was very attentive and friendly. This place goes above and beyond. Right when we were walking in a waitress ran after a guest who forgot their phone. It just shows how much they care. 10/10 will be going back again."
        ]
    },
    {
        "Name": "Izakaya Mai",
        "Rating": 4.2,
        "About": "212 2nd Ave, San Mateo",
        "Reviews": [
            "The service here is wonderful. They are always so kind and pleasant , and attentive to everyone, regardless of age, demographic, or group size, or time of night, business level\nTheir drinks are delicious\nFood is delicious and fresh\nMy favorites are the jalapeno with spicy tuna, and chicken curry\nGreat for a meal before or after a movie",
            "My partner and I was hungry on a Friday night and came upon Izakaya Mai when we were walking in San Mateo downtown. The place looked like there were alot of people and we gave it a try. We ordered the okonomiyaki, the katsu curry over rice with soup and salad, and the fire special roll. The okonomiyaki came out first and it was really big. There was ramen and bonito flakes on top of it, the inside of the pancake has seafood, octopus, vegetables, all drizzled in mayo and bbq sauce. It was very hot, fresh and savory. We loved every bite of it. The katsu curry over rice was delectable, the curry had a hint of sweetness but it was very rich. The katsu was crunchy and so good over the rice. The fire roll was big, and nicely presented. The two of us couldn’t finish the things we ordered and had to bring food home. The vibes of the place was superb. It’s a great place for friends, families, and dates to meet up at. There are items that aren’t too expensive and very good for the price. The staff are really friendly as well.",
            "If you want better sushi, there are better places. If you want better ramen, there’s better too.\n\nBut this restaurant has GOOD food after the GREAT restaurants are closed.  Would go again, but not my top choice.\n\nGreat alcohol choices tho. Highly recommend the eggplant dishes.\n\nFollow me for more fire reviews.",
            "The food is delicious. The edamame is great, which is not always the case in other restaurants. Order it unsalted. I don’t mind salt, but the default level of salt on them is too much for me. Other than that it’s a great restaurant.\n\n(Although there is a Mini with the Union Jack design on the wall that is driving on the wrong side of the road.)",
            "Nice little Japanese restaurants located in the downtown dog San Mateo.  A lot of food varieties and many different kinds of sake to choose from.\nThe taste is quite good and the price is reasonable."
        ]
    },
    {
        "Name": "Tannourine Restaurant",
        "Rating": 4.4,
        "About": "120 W 25th Ave, San Mateo",
        "Reviews": [
            "This is an iraqi-lebanese restaurant, very authentic, we tried over 10+ dishes, with a group of Arabs and everything was perfect, 100% authentic like being in the middle east. This is the best Arabic food in the bay area hands down, it's a must try place. The only place that has stews that you will never find anywhere else. The service is great, the owners are very nice, the atmosphere is calm and elegant ,and the energy is beautiful. I would go every day if I could. The prices are very reasonable for the high quality food.",
            "The lamb shank was excellent.  The taboulleh was great and in the style that favors parsley.  The dolma was fresh and moist with a hint of red pepper.  Overall, really good Middle Eastern food - coming from someone that grew up with these foods.",
            "Perfect middle eastern cuisine. We found it completely unexpected. The food is very well prepared. I hope to come back soon.",
            "Food was amazing best food I got in Bay Area, service was great too. Definitely will go again",
            "Awesome food with really authentic flavors. Service can be a bit slow but I don't mind that for the quality of the food.\nIf the restaurant was a little more upbeat or maybe played Lebanese music I would come here all the time. I ordered the semak harra (spicy fish) and it was really awesome - not too spicy at all!"
        ]
    },
    {
        "Name": "Crepevine Restaurants",
        "Rating": 4.5,
        "About": "1310 Burlingame Ave, Burlingame",
        "Reviews": [
            "We’ve been coming to this particular Crepevine Restaurant for quite a few years.  We have never had a bad meal or a bad experience here.  All the food is freshly prepared and delicious!  Most of the dishes come in large portions, and many people end up taking food home with them.  The way this restaurant is laid out, keeps wait times down to a minimum during the busy hours.  No reservations, just show up, order and be seated.  Food comes very quickly.  The restaurant staff are extremely friendly, helpful and efficient.  There are many items to choose from on their unique menu board, so you can easily pick something different each time you visit.  Highly recommend the Crepevine for breakfast, lunch or dinner if you are on or near Burlingame Avenue.",
            "We tried Crepevine for dinner in Burlingame because we liked the one in Mountain View already. Technically, they’re the same because they’re chain restaurants. Same menu, same atmosphere.\nThe staff were friendly and attentive. The food and drink came fast. To be honest, we just paid and were looking for a table. When we found one, the drink was ready and the waitress came to us (I was holding the number) and asked “you guys ordered lemonade?”. I said ‘yes’ and pointed to the available table. After that, the food came out in less than 5 minutes.\nBig portion food. Both my husband and I struggled to finish our dishes. We both thought we over ordered them.\nWe ordered one Thai savory crepe, one Capri pasta, one Clam chowder soup and Lemonade. Good quality food though.",
            "Loved this place. If I wasn't traveling through and I lived there I'd for sure visit again. Loved the whole vibe of not only the restaurant but the outside decor of this whole area. Think it was called Burlingame",
            "It was a busy place, but they were quick getting us in and out. The food portions were huge and they were delicious. Would definitely eat here again.",
            "This is one of my favorite spots in burlingame for casual dining.   The food is flavourful. Good size servings. A great variety of food with fresh juices options and drinks."
        ]
    },
    {
        "Name": "La Lanterna",
        "Rating": 4.4,
        "About": "180 W 25th Ave, San Mateo",
        "Reviews": [
            "I went there with my family on a Tuesday night. I noticed the restaurant was under staff (its the holiday season) and food was ok. The pork was greasy and over breaded. The Caprese salad was presented cute but not enough tomato and arugula. The tomato or Mariana sauce was good. The elderberry martini had a kick but it was delicious if you like something new. The dessert was the best part: bread pudding, gelato and crème brûlée. They sold out of tiramisu that day.",
            "We had our Italian family gathering at La Lanterna on a Sunday afternoon. They opened specially for our event. I had made all the arrangements in advance with Michael, including the menu. The event went off perfectly and flawlessly. The food, from the appetizers to the deserts was outstanding, especially the gnocchi. This restaurant is a perfect place to have a special event! And there is no charge for the room.",
            "My mom and I like to have girl dates here and love the food and wait staff. Michael and the rest of the team are incredibly kind and always make us feel welcome. I have loved every plate we ordered and the deserts are just as good. I definitely recommend this place.",
            "Highly recommended. I have dined there dozens of times. It is always a great experience.\nHigh grades for both food (try the cannelloni) and the very friendly service.\n\nThe cannelloni and Caesar salad are so good, I have a hard time ordering anything else!",
            "The service is impeccable. The food tastes great to me. Very authentic Italian as I was told by friends. But I wouldn't know. The desert selection is pretty great. We work next door and pretty much eat here a few days a week. Still not tired of it."
        ]
    },
    {
        "Name": "La Fonda de San Mateo",
        "Rating": 4.4,
        "About": "2310 S El Camino Real, San Mateo",
        "Reviews": [
            "The place had beautiful stained glass all over, loved the vibe! There weren't too many people on a Thursday evening. My friend and I ordered enchiladas, they were really good. We were surprised that we were able to finish our portions. Tortilla chips were super hard and we didn't end up having any! The server was very kind and patient ✨",
            "This is a busy family run restaurant. Make a reservation  during peak times is my suggestion. The service is super friendly and fast and they make you feel special. The ambiance is warm, vibrant and reminds of Mexican hacienda. The servings are generous. The food overall is well presented and tasty. Yup, try this restaurant. You will like it.",
            "Has amazing food and I have had a great share of Mexican restaurants.  Margaritas are a little strong but the food was great.  If I can ask someone there I’m not from the area I would like to know the ingredients of the salad that comes with the burrito you order.",
            "Very flavorful.\nA good balance between not so fatty, but not dry.",
            "Super cute Mexican restaurant with probably the nicest waitress I've ever had. Everything we ordered was delicious. Chips were thick and extra crunchy."
        ]
    },
    {
        "Name": "Tastee Grill Catering",
        "Rating": 4.3,
        "About": "1001 Park Pl, San Mateo",
        "Reviews": [
            "Stepped into tastee grill and was greeted with the most vibrant plate of falafel I've ever laid eyes on! The falafels were a masterpiece of texture, with a crispy exterior giving way to a tender, aromatic heart. Nestled alongside a creamy, perfectly seasoned hummus, every bite was a harmony of flavor. The colorful array of fresh vegetables and pickles added a delightful crunch, making each forkful a fresh experience. It's not just a meal; it's a culinary journey that excites the taste buds and nourishes the soul. Hats off to the chef for presenting such a beautifully balanced dish. A must-try for anyone who loves Middle Eastern cuisine with a touch of gourmet flair!",
            "When searching for the 'best Mediterranean restaurant in San Mateo' or craving an 'authentic Italian meal in the Bay Area', look no further than Tastee Grill Catering. This eatery is a top choice for food lovers, seamlessly blending the rich, aromatic flavors of Mediterranean dishes with the timeless appeal of Italian cooking, and the classic, satisfying tastes of American fare. Perfectly situated in San Mateo, it stands out as a prime destination for 'Bay Area catering services', 'San Mateo lunch spots', and 'diverse dining experiences in the Bay Area'. Whether you're in for a business lunch, a family dinner, or searching for 'quality catering near me', Tastee Grill Catering offers a menu that's expertly crafted to meet diverse palates, making every visit a delightful journey through some of the world's most beloved cuisines.",
            "Looking for great Mediterranean or Italian food in San Mateo? Try Tastee Grill Catering! They combine Mediterranean, Italian, and American flavors perfectly. It's a top spot in San Mateo for lunch, dining, or catering. Whether it's a business meal or family dinner, their menu caters to all tastes, promising a fantastic culinary experience.",
            "I’ll start with  notification: This none Kosher place .\n\nThe place is quite small ( not a restaurant more like a small hut)\nThe owner is very kind and generous..\nunfortunately the food grade is quite poor.\nThe Pita was stiff and they apologised for it. The rice was good and Falafel is 7 not more than that..\nThe owner proposed me immediately compensation a plate of Hummus\nSo as i said.. very kind and fair but the food must improve..\nI think the place got new branding ..”Tastee Grill”",
            "If you're in San Mateo and craving some authentic Mediterranean flavors, Tastee Grill is a must-visit! Their falafels are a delightful blend of crispy and tender, perfectly spiced and even gluten-free! The menu boasts an array of vegan options too. The Sauteed Eggplant is cooked to perfection, and the Sauteed Mushroom side is a umami-packed delight. Don't skip the Sauteed Cauliflower; it's a deliciously seasoned, healthy treat. Their Small Tabouli Salad is fresh, with the perfect balance of parsley, tomatoes, and bulgur. And their Lentil Soup, available in multiple sizes, is hearty and comforting. Everything is affordably priced and the portions are generous. Tastee Grill in San Mateo is the place for fresh, flavorful, and authentic Mediterranean dishes. A five-star experience!\n\n#SanMateoEats #MediterraneanDining #TasteeGrill #FalafelLove #VeganOptions #GlutenFree #HealthyEating #FlavorfulMediterranean #SanMateoRestaurants #DineLocal #GoogleLocalGuide"
        ]
    },
    {
        "Name": "Hummus Mediterranean Kitchen",
        "Rating": 4.3,
        "About": "150 E 4th Ave, San Mateo",
        "Reviews": [
            "From its clean and parking-friendly atmosphere to its accommodating seating arrangements, the restaurant set the stage for an enjoyable meal.\n\nOne aspect that particularly impressed me was the diverse menu options catering to both vegetarians and non-vegetarians. My party and I sampled a variety of dishes, including the falafel, butcher's cut lamb koftedes, chicken gyro platter, and baba ganush. Each dish was expertly prepared, bursting with flavor, and beautifully presented.\n\nFurthermore, it was reassuring to note that all meat served at the restaurant is halal, ensuring inclusivity for guests with dietary preferences.\n\nIn addition to the culinary delights, the pricing was reasonable, offering excellent value for the quality of food and service provided.",
            "Would definitely come back. Had sangria, wine, cheese and mushrooms pide, Appetizer sampler platter. Food was good and service was great too. You need to pair the Appetizer with something to dip and enjoy with. Do visit if you are near by and love some Mediterranean food ❤️❤️",
            "Very clean establishment. Ordered the Hummus flight that has all four of the homemade hummus flavors (classic, olive&feta, beet, and chipotle). All were very good - the Chipotle has a mild kick that gets stronger on the palate as you enjoy it!! And very good Turkish coffee, offered with or without sweetening. Very pleased! Very pleasant staff.",
            "We came here a few times for lunch / dinner. You order first and then they give you a number which you can bring to your table. It might take a while for them to bring you the food but it’s worth it.\n\nThe meat here is so fresh! We got the combo plate and the red lentil soup. The combo plate has beef kabob, chicken kabob, kofte meatball and lamb and beef gyro. The meat is usually very fresh and the sauces are delicious. The red lentil soup is average at best, it was quite bland and I had to add a bit of salt to make it taste okay.\nEach item came with two pieces of pita bread as well.",
            "The staff is very friendly and informative. We ordered the appetizer platter and the meat combo. All tasted delicious. Everything on the appetizer platter tasted fresh and perfect for someone who wants to try everything on the menu."
        ]
    },
    {
        "Name": "Maria's Restaurant",
        "Rating": 4.1,
        "About": "1452 Cary Ave, San Mateo",
        "Reviews": [
            "The PUPUSAS were Delicious... but the restaurant did NOT meet the Request for 6 Well toasted(VIEN DORADAS) Pupusas. We provided the restaurant with a advanced order of 30 minutes. We had to wait another 20 minutes upon arrival.  The Food Order was 6 PUPUSAS  well toasted. I will make the same orde at AMERICAN HOUSE to see if they can Satisfy a Customer .",
            "I love their food it's so good. Especially the Pupusas. Food is always fresh out which makes it even better",
            "I've been here 2-3 times in the past and this place by far has the most delicious pupusas in San Mateo. Most places skimp on the filling, not these guys, the filling just oozes out begging to be enjoyed 🤗\n\nHad the atol de elote and it was nothing special. This review is only based on the pupusas.",
            "Pupusas were so good, the casamiento was good too,definitely coming back when im this area",
            "The hotel is very beautiful, the management is very good"
        ]
    }
]