[
    {
        "Name": "Limón",
        "Rating": 4.4,
        "About": "1101 Burlingame Ave, Burlingame",
        "Reviews": [
            "This place is amazing, every dish was near perfection, though the empanadas and the tuc tuc could be improved, they were slightly under flavored.\n\nI highly recommend the pork belly fried rice, it was so delicious and the pork we're cooked over long time making it crispy and packed with flavor.",
            "The portion of the food was big, they gave you lots of beef for one dish. I liked my lomo saltado, good flavor with nice rice. I am not a big fan of soaked in sauce fries, it will be better if the rice was at the bottom of my dish. The garlic bean was so delicious!\nService was great! Drinks are creatively good.",
            "Finally got to check this place out! We (party of 2) came for dinner on Friday and was seated right away despite having no reso.\n\nThe service here is really good and our waiter was very attentive. Despite being busy he always promptly filled our water.\n\nWe got the ceviche limon, quarter chicken, pork belly fried rice, and mango panna cotta.\nCeviche limon: it has 2 scallops, shrimp, red snapper, and crispy calamari. We got taro chips on the side. Everything was really yummy and I like that there’s sweet potato and corn that adds to the flavor.\nThe half chicken was slightly disappointing. The meat was not very juicy and not tender. We got the chifa vegetable and I felt it was too salty and could’ve been better\nThe pork belly fried rice was quite nice, they give four pieces of pork. The pork is crispy, tender and flavourful.\nMango panna cotta was also very delicious, highly recommend. It’s sweet but not too sweet, and the strawberries are a nice touch.\nThey also have yummy cocktail but they are on the sweeter side.\n\nAll in all would come back again, it’s a little pricy but I enjoyed most of the things we got.",
            "During the COVID period, I visited Limon Restaurant’s San Francisco location and was impressed by the delicious and well-cooked rotisserie chicken. This positive experience led me to try out their Burlingame location last weekend. Unfortunately, my recent visit left much to be desired.\nI ordered empanadas, ceviche, Arroz con pollo, and Arroz con mariscos. While the ceviche was fresh and delicious, the empanadas were just okay. However, the Arroz con mariscos lacked flavor compared to their other locations, and the Arroz con pollo was outright disappointing. The chicken was undercooked, and the rice was overly greasy, prompting me to return the dish after just two bites. Shockingly, I was still charged for it.\nThe restaurant’s atmosphere is lively, and the staff are fast and efficient. However, I was not pleased with their attitude towards complaints about the food.\nOverall, my recent experience at Limon Restaurant in Burlingame fell short of expectations, and I left feeling dissatisfied.",
            "Delish!  Nice place to try Peruvian fare.  Atmosphere is lively.  Staff were friendly and efficient.  Our server took the time to explain the menu and recommend dishes to our group.  I recommend.  Parking can be difficult during the weekends."
        ]
    },
    {
        "Name": "Jack's Restaurant & Bar",
        "Rating": 4.4,
        "About": "1750 S El Camino Real, San Mateo",
        "Reviews": [
            "We came here once for brunch and once for dinner. It gets quite busy during peak brunch time, but the restaurant is huge and we were seated very quickly.\n\nThey have a huge menu with a Greek influence. I really enjoyed their gyros and lamb burger. Gyros had warm toasted pita bread which went really well with the meat and cucumber. The sauce was a perfect amount. Lamb burger is super flavorful and something I’ve never tried before. We followed the waiters suggestion on the recommended doneness and it was really good. Their breakfast hash is also a winner - perfectly crispy on one side and soft on the other.\n\nI got their strawberry cooler mocktail which was way too sweet and difficult to drink because they did not balance the sweetness with any other flavor.",
            "We have enjoyed Jack’s food for many years now. Great for either dining in or take out. Staff is always courteous and efficient, and the large menu makes it easy for every family member to find something they like. Large parking lot with plenty of parking.",
            "Had a very nice evening at Jack's. We were seated right away. Nolan's service was excellent - very nice and attentive. Food was great and came out quickly, even though the restaurant was quite busy.",
            "Ate here on our layover in San Francisco. The food was delicious and large portions. Great atmosphere and staff. Daughter kid meal was spaghetti and huge meatball. I had the fried chicken on the early bird meals, highly recommended.",
            "It was my first time there and I'll definitely be returning. High ceilings and plenty of room for large or small parties.The food AND service was AMAZING. I don't remember the pasta name I got but it was really good. The calamari appetizer was fantastic. This is the first restaurant I've been to where they actually know how to cook salmon. The server was very attentive and friendly. This place goes above and beyond. Right when we were walking in a waitress ran after a guest who forgot their phone. It just shows how much they care. 10/10 will be going back again."
        ]
    },
    {
        "Name": "Crepevine Restaurants",
        "Rating": 4.5,
        "About": "1310 Burlingame Ave, Burlingame",
        "Reviews": [
            "We’ve been coming to this particular Crepevine Restaurant for quite a few years.  We have never had a bad meal or a bad experience here.  All the food is freshly prepared and delicious!  Most of the dishes come in large portions, and many people end up taking food home with them.  The way this restaurant is laid out, keeps wait times down to a minimum during the busy hours.  No reservations, just show up, order and be seated.  Food comes very quickly.  The restaurant staff are extremely friendly, helpful and efficient.  There are many items to choose from on their unique menu board, so you can easily pick something different each time you visit.  Highly recommend the Crepevine for breakfast, lunch or dinner if you are on or near Burlingame Avenue.",
            "We tried Crepevine for dinner in Burlingame because we liked the one in Mountain View already. Technically, they’re the same because they’re chain restaurants. Same menu, same atmosphere.\nThe staff were friendly and attentive. The food and drink came fast. To be honest, we just paid and were looking for a table. When we found one, the drink was ready and the waitress came to us (I was holding the number) and asked “you guys ordered lemonade?”. I said ‘yes’ and pointed to the available table. After that, the food came out in less than 5 minutes.\nBig portion food. Both my husband and I struggled to finish our dishes. We both thought we over ordered them.\nWe ordered one Thai savory crepe, one Capri pasta, one Clam chowder soup and Lemonade. Good quality food though.",
            "Loved this place. If I wasn't traveling through and I lived there I'd for sure visit again. Loved the whole vibe of not only the restaurant but the outside decor of this whole area. Think it was called Burlingame",
            "It was a busy place, but they were quick getting us in and out. The food portions were huge and they were delicious. Would definitely eat here again.",
            "This is one of my favorite spots in burlingame for casual dining.   The food is flavourful. Good size servings. A great variety of food with fresh juices options and drinks."
        ]
    },
    {
        "Name": "Tastee Grill Catering",
        "Rating": 4.3,
        "About": "1001 Park Pl, San Mateo",
        "Reviews": [
            "Stepped into tastee grill and was greeted with the most vibrant plate of falafel I've ever laid eyes on! The falafels were a masterpiece of texture, with a crispy exterior giving way to a tender, aromatic heart. Nestled alongside a creamy, perfectly seasoned hummus, every bite was a harmony of flavor. The colorful array of fresh vegetables and pickles added a delightful crunch, making each forkful a fresh experience. It's not just a meal; it's a culinary journey that excites the taste buds and nourishes the soul. Hats off to the chef for presenting such a beautifully balanced dish. A must-try for anyone who loves Middle Eastern cuisine with a touch of gourmet flair!",
            "When searching for the 'best Mediterranean restaurant in San Mateo' or craving an 'authentic Italian meal in the Bay Area', look no further than Tastee Grill Catering. This eatery is a top choice for food lovers, seamlessly blending the rich, aromatic flavors of Mediterranean dishes with the timeless appeal of Italian cooking, and the classic, satisfying tastes of American fare. Perfectly situated in San Mateo, it stands out as a prime destination for 'Bay Area catering services', 'San Mateo lunch spots', and 'diverse dining experiences in the Bay Area'. Whether you're in for a business lunch, a family dinner, or searching for 'quality catering near me', Tastee Grill Catering offers a menu that's expertly crafted to meet diverse palates, making every visit a delightful journey through some of the world's most beloved cuisines.",
            "Looking for great Mediterranean or Italian food in San Mateo? Try Tastee Grill Catering! They combine Mediterranean, Italian, and American flavors perfectly. It's a top spot in San Mateo for lunch, dining, or catering. Whether it's a business meal or family dinner, their menu caters to all tastes, promising a fantastic culinary experience.",
            "I’ll start with  notification: This none Kosher place .\n\nThe place is quite small ( not a restaurant more like a small hut)\nThe owner is very kind and generous..\nunfortunately the food grade is quite poor.\nThe Pita was stiff and they apologised for it. The rice was good and Falafel is 7 not more than that..\nThe owner proposed me immediately compensation a plate of Hummus\nSo as i said.. very kind and fair but the food must improve..\nI think the place got new branding ..”Tastee Grill”",
            "If you're in San Mateo and craving some authentic Mediterranean flavors, Tastee Grill is a must-visit! Their falafels are a delightful blend of crispy and tender, perfectly spiced and even gluten-free! The menu boasts an array of vegan options too. The Sauteed Eggplant is cooked to perfection, and the Sauteed Mushroom side is a umami-packed delight. Don't skip the Sauteed Cauliflower; it's a deliciously seasoned, healthy treat. Their Small Tabouli Salad is fresh, with the perfect balance of parsley, tomatoes, and bulgur. And their Lentil Soup, available in multiple sizes, is hearty and comforting. Everything is affordably priced and the portions are generous. Tastee Grill in San Mateo is the place for fresh, flavorful, and authentic Mediterranean dishes. A five-star experience!\n\n#SanMateoEats #MediterraneanDining #TasteeGrill #FalafelLove #VeganOptions #GlutenFree #HealthyEating #FlavorfulMediterranean #SanMateoRestaurants #DineLocal #GoogleLocalGuide"
        ]
    },
    {
        "Name": "Hummus Mediterranean Kitchen",
        "Rating": 4.3,
        "About": "150 E 4th Ave, San Mateo",
        "Reviews": [
            "From its clean and parking-friendly atmosphere to its accommodating seating arrangements, the restaurant set the stage for an enjoyable meal.\n\nOne aspect that particularly impressed me was the diverse menu options catering to both vegetarians and non-vegetarians. My party and I sampled a variety of dishes, including the falafel, butcher's cut lamb koftedes, chicken gyro platter, and baba ganush. Each dish was expertly prepared, bursting with flavor, and beautifully presented.\n\nFurthermore, it was reassuring to note that all meat served at the restaurant is halal, ensuring inclusivity for guests with dietary preferences.\n\nIn addition to the culinary delights, the pricing was reasonable, offering excellent value for the quality of food and service provided.",
            "Would definitely come back. Had sangria, wine, cheese and mushrooms pide, Appetizer sampler platter. Food was good and service was great too. You need to pair the Appetizer with something to dip and enjoy with. Do visit if you are near by and love some Mediterranean food ❤️❤️",
            "Very clean establishment. Ordered the Hummus flight that has all four of the homemade hummus flavors (classic, olive&feta, beet, and chipotle). All were very good - the Chipotle has a mild kick that gets stronger on the palate as you enjoy it!! And very good Turkish coffee, offered with or without sweetening. Very pleased! Very pleasant staff.",
            "We came here a few times for lunch / dinner. You order first and then they give you a number which you can bring to your table. It might take a while for them to bring you the food but it’s worth it.\n\nThe meat here is so fresh! We got the combo plate and the red lentil soup. The combo plate has beef kabob, chicken kabob, kofte meatball and lamb and beef gyro. The meat is usually very fresh and the sauces are delicious. The red lentil soup is average at best, it was quite bland and I had to add a bit of salt to make it taste okay.\nEach item came with two pieces of pita bread as well.",
            "The staff is very friendly and informative. We ordered the appetizer platter and the meat combo. All tasted delicious. Everything on the appetizer platter tasted fresh and perfect for someone who wants to try everything on the menu."
        ]
    },
    {
        "Name": "Maria's Restaurant",
        "Rating": 4.1,
        "About": "1452 Cary Ave, San Mateo",
        "Reviews": [
            "The PUPUSAS were Delicious... but the restaurant did NOT meet the Request for 6 Well toasted(VIEN DORADAS) Pupusas. We provided the restaurant with a advanced order of 30 minutes. We had to wait another 20 minutes upon arrival.  The Food Order was 6 PUPUSAS  well toasted. I will make the same orde at AMERICAN HOUSE to see if they can Satisfy a Customer .",
            "I love their food it's so good. Especially the Pupusas. Food is always fresh out which makes it even better",
            "I've been here 2-3 times in the past and this place by far has the most delicious pupusas in San Mateo. Most places skimp on the filling, not these guys, the filling just oozes out begging to be enjoyed 🤗\n\nHad the atol de elote and it was nothing special. This review is only based on the pupusas.",
            "Pupusas were so good, the casamiento was good too,definitely coming back when im this area",
            "The hotel is very beautiful, the management is very good"
        ]
    },
    {
        "Name": "America's House",
        "Rating": 4,
        "About": "1440 Cary Ave, San Mateo",
        "Reviews": [
            "Ordered the menudo, and it had a good clean flavor, but to spice things up, I added my own habanero. Bones had a good amount of tendon, which contains collagen. Have a bowl and watch the wrinkles on face disappear. Cheers!",
            "Authentic Salvadorian food.\nI love fried plantains also the chicken tamales were so good. They have an airy enclosed porch with cool lighting. I bet for a party it would be a great spot. Great Latin music playing . Very nice staff took good care of us at lunch!",
            "It was a place with high reviews, but we were disappointed. It took a long time for our food to be ready when the restaurant wasn’t even full. When it did come, our food looked sad. Don’t know why other’s food looked so amazing on the the photo reviews. The soup is salty and old. The caldo de pollo is kind if plain. We also ordered a strawberry milkshake but it also didn’t taste good.",
            "Their rice pupusas are great.  Service was better this visit.  Our last visit we waited about 15-20 minutes for them to close us out but this time it was faster.",
            "Food was so bland, my husband ordered chile verde and even in the picture it showed chunks of meat. Chile verde is pork simmered in a green sauce, he got carne asada and it did not taste good. Beans were bland rice did not look or taste like a Mexican rice. I had huevos rancheros with chorizo I took one bite it was not tasty it came with potatoes which were bland. Horrible meal. We ordered a side cheese pappusa it was tasty. Service was nice. I'm never going back to this restaurant."
        ]
    },
    {
        "Name": "Pantry Family Restaurant",
        "Rating": 4.2,
        "About": "1855 S Delaware St, San Mateo",
        "Reviews": [
            "I love a quiet, laid-back diner, especially when the staff know and joke around with the regulars!\nI also found the omelet to be unique, I’m used to the ingredients being mixed with the egg, but here they wrapped the egg around the ingredients! Genius. 10/10",
            "This is a non-descript place with American and Filipino fare. Prices are very reasonable with good-sized portions. There’s plenty of free parking, decent service, and a very relaxed setting. While I’ve had better, I would go back. My son and I both had the linguica with hash browns, and it was decent. My wife had the Longanisa with rice, and I thought it was very good. Better Longanisa than I’ve had elsewhere and what I would get next time.",
            "Tun building design. You walk in and you can sit on either side. The entrees come with rice or hash browns but you can get half and half. I really liked the option of linguica or longanisa. Loco moco meat was great and the gravy was very normal and not exactly what I’d expect as if we were at a Hawaiian place (shoyu, Worcestershire). My friend really enjoyed the hash.",
            "I have gone here for years, and the food is always on point.  I love that you can get half and half with hashbrowns, rice, and toast. I'm sorry but I'm filipino and I need all my carbs. I love that they get me.\n\nThis time aroud service was lacking. They were quick to take your order and give you your food but never came back to check on us to provide refills, to go box, or even give you the ticket to pay.\n\nIt wasn't busy when we got there, not when we were done. They didn't even look at us. They just had us sit there.  I waited politely at least a good 15-20 minutes.  I got up and had to ask for everything so we can leave",
            "Had scrambled eggs with ham, hash browns, biscuit, s/o country gravy. Eggs & ham were fine. Hashbrowns were unedible mush with onion & seasoning on top. Gravy was horrible!!! It was cornstarch goop with pieces of ham, linguica maybe, & not sure what other kind of meat. Gravy out of a can would have been better! No butter for the biscuit. Waitress did not come back after delivering meal.Very disappointing!"
        ]
    },
    {
        "Name": "Flights Restaurant By Alex Hult - Burlingame",
        "Rating": 4,
        "About": "1100 Burlingame Ave, Burlingame",
        "Reviews": [
            "Food here was amazing.\nWe started with the mimosa flight definitely a nice start for the meal, accompanied by the French fries flight.. highly recommend.\n\nOther items we ordered:\n1. Skewer flight - it looks like it's not a lot but boy is it filling.  Everything was so juicy and tender.\n\n2.  Cast iron skillet - everything here was so tasty, the best one in our opinion was the pulled pork.\n\n3.  Classic breakfast - can't go wrong with a classic.  Bacon was nice and crispy.  Potato hash was crunchy and so flavorful.\n\n4. Chicken and waffles- something so simple but well executed.\n\n5. Cheesecake flight - it's alright. I don't really recommend.  This felt super basic but didn't really add anything to the experience. This was the only item we didn't really touch or finish.  It literally tasted like cheesecake with different toppings on it.  Very uneventful.\n\n6.  Brownie bomber - highly recommend. This one had us stop talking mid conversation when we saw this beautiful thing walking towards us. We were fighting for this one.  Everything about it was so comforting.. even if you feel so full that you don't have space for dessert... trust you will have space for this...",
            "Flights honestly shouldn’t be so good every time I go. Wife and I went to this one in fancy-pants B’game as a sort of last acceptable resort. And it was all damned great. The Sunday hash brown flight and chicken and waffles were outstanding. I did the margarita flight and it buzzed me in an ideal way. Wife sipped a really good strong ginger beer mixed in site. Then the bread pudding dessert capped it all with great presentation, flavor, and hot/cold layers. Just solid. AGAIN.",
            "The food was delicious! The drinks were awesome. Loved the service and the outside seating. Will definitely come again when I’m in town",
            "The staff was phenomenal! Everyone was polite respectful and courteous. Also helpful at recommending a variety of food and drink options. Truly enjoyed my cocktails. Thank you to the young men and women who work at your establishment!",
            "Unique little cocktail bar and food joint locatepid in a lovely area of Burlingame with ample outdoor and indoor seating, shareable drink flights, and food flights as well. This restaurant specializes in \"flights\" of food in drinks - which is essentially several different types of a food or drink served at a type. For example, the margarita flight is several flavors of margaritas at a time for 24$. The flight of fries was pretty good with three different seasonings and dips!\n\nThe high points of this restaurant is the unique flight theme, everything is themed after aviation including the attire of the servers, and the inside is well designed! Areas for improvement here could be the cocktails and the way the happy hour menu is designed. The cocktails were unique but a little heavy on the sugar content - especially the margaritas. Also, it was unfortunate that you are limited on the happy hour menu to the time that you're there (you can't order later items for HH prices). Unique idea but disadvantages early starters.\n\nOtherwise, this is a highly recommended establishment for drinks with friends. Great outdoor seating, friendly staff, good food, and just a good vibe all around. Recommend coming here if you're in the Burlingame area!"
        ]
    },
    {
        "Name": "Jack in the Box",
        "Rating": 3.5,
        "About": "555 E 3rd Ave, San Mateo",
        "Reviews": [
            "Look I know it’s just a fast food restaurant so I’m not expecting the moon but the service was terrible. The young lady at taking our order had the enthusiasm of a death row inmate. She didn’t confirm our order or even ask what size we wanted she just put it in. The we get our food and the “large” curly fry is not only half empty when I get home I realize they put regular fries at the bottom because they didn’t have enough. Instead of making more they just gave us a half empty box with regular fries at the bottom. I’m not surprised the line was empty with this type of service. And the “bacon strips” on the sandwich were a joke. Safe to say I will never go back. I’m surprised we even got the items we ordered.",
            "Is your average Jack in the box.  Conveniently located in downtown San Mateo and open 24 hours a day.  This spot is perfect for late night munchies or any on-the-go meal.  I personally love the egg rolls 😋.",
            "The ppl were nice, helpful and had a good attitude thru the ordering process,\nThe food didn't take to long like other places,\nThe food was great an tasty.",
            "The meat was hard and dry as hell as if the meat had been sitting all day I didn’t notice until I got back to work but the cashier had wonderful customer service",
            "I ordered an extreme sausage combo sandwich.  The sandwich appeared to be reheat.  The sausages razor thin not plump The hashbrown was lukewarm.  Now is 2 hours later.  I am having my second diarrhea.  So you tell me how many stars."
        ]
    },
    {
        "Name": "Stacks",
        "Rating": 4.4,
        "About": "361 California Dr, Burlingame",
        "Reviews": [
            "There was a long line but don’t be deterred if you are only a party of 2! We got seating immediately at almost 11. All portion is huge and the crab omelette especially has fresh and plenty crab meat. The bagels are so unique to see in a brunch restaurant. Very hearty breakfast and we took home so much leftover. Beautiful, vintage, French style interior and a lively atmosphere. Food did take longer to come out.",
            "Came here on a Sunday afternoon and the wait was about 10 minutes!\n\nGood:\n- The portion sizes are huge! I had to take part of it home with me.\n- The bagel with cream cheese that came with my omelette was great.\n- The inside is so pretty! I loved the decorations\n- The price is okay for brunch - a bit on the higher end.\n\nBad:\n- The omelet tasted pretty weird - I think it was the cheese or something a bit sourer than I liked\n- The cottage cheese substitution that I did also was a little sour\n\nOverall this place was an okay brunch place, but I wouldn't come again.",
            "After 25+ years of patronage, today I was insulted, abashed, and beyond disappointed.\n\nWHEN YOU READ A BAD REVIEW, BELIEVE IT.\n\nStale tortillas, canned & rancid salsa, and undercooked cheese; the restaurant’s manager is a disgrace. He should not be in leadership.\nHis response to my request “if you want better  tasting Mexican, this is not the place”, and “we have no other complaints”, and “the people around here don’t know the difference”.\n\nOwner GEOFFREY SWENSON, PLEASE TAKE NOTICE:\n\nWhen I asked him for the bill of just my coffee, and pointed out that at any restaurant in the Bay Area, no matter what the venue, you will find the south of border dishes to be excellent. He kept interrupting me, and even raised his voice; tables nearby began turning their heads and he was loud enough to attract the attention from the kitchen staff and other waiters.\n\nDisgraceful and very sad to see my favorite family & High School breakfast spot has fallen to the pits of a bad manager. Keep in mind, I’m almost 50 years old, so my review is with experience at this restaurant.",
            "Great breakfast place!  It's a little pricey ($18.50) for pancakes, but it is delicious.  If you are in the area, coming or going from SFO, this is a must.\n\nBlueberry pancakes.  The stack comes in threes and is a full dinner plate.",
            "Beautiful place and busy. We were greeted immediately and seated.  Waitress was nice but curt with me.  She asked me what I was having.  I told her Gourmet Turkey meal.  She said with fries I said no and then she said potato toes I said no. I finally said salad she said that comes with the meal.  I said okay. I asked kind of salad dressing can’t recall that but asked what kind do you have?  She said we have balsamic.  I said does it have soybean oil in it and she it balsamic it shouldn’t so I responded well it could.  You would think if someone tells you he/she has a food allergy the restaurant establishment would do its due diligence to simply check the label.  Poor service"
        ]
    },
    {
        "Name": "La Chapina Restaurant",
        "Rating": 4,
        "About": "215 S Delaware St, San Mateo",
        "Reviews": [
            "Why do I always give five stars to my posts? Because I won't diss a place because it doesn't appeal to me. I enjoyed an early morning breakfast at La Chapina. This restaurant/ bakery is a working person's early morning fuel stop. No frills, but decent coffee, great central American pastries, hot breakfast and lunch menu, like traveling in Guatemala in the middle of the peninsula megalopolis. For me, La Chapina was a totally cool experience. It's open air, enclosed patio and warehouse style seating, be forewarned.",
            "Malísimo\nWe were craving from some flavor from my country. We found this place which fachade we thought was proper however, the service sucks, the bread was from yesterday, and the food was so expensive and bad quality. We have to walk out when they told us after a very long time that our order couldn’t be filled  because they didn’t have some ingredients…",
            "2022 update.\n\nFood is delicious like the first day!!\n\n2021\nSmall restaurant & bakery, a hidden diamond in the wall. Food was delicious.\nMilanesa 5/5\nCaldo de res 5/5\nPacaya 5/5\nCarne asada plate 5/5\nRellenitos 5/5",
            "This is the abuelita's cooking right here! I had never tried Guatemalan food we got there at 9 they close at 10 and they still took us in. Service was okay and food took a while to come out but it was so worth the wait. I order El caldo de Gallina to go and had it for breakfast it was just the perfect way to starty day!",
            "Large selection of daily fresh baked Guatemalan sweets, pan dolce, etc."
        ]
    },
    {
        "Name": "Pancho Villa Taqueria",
        "Rating": 4.2,
        "About": "365 S B St, San Mateo",
        "Reviews": [
            "have been coming here for a long time.\nFood is always good\ngood quality\nsalsa de chile de árbol is very good and spicy.\nDrinks are fresh and are not artificial\nLarge portions\nparking can be hard to find for larger vehicles",
            "We came back to this restaurant again after three years. We ordered the Burrito with prawns and steak. The quality of the food was the same as it was three years ago. The prawns tasted yummy and tender, and the steak was juicy\n\nOnly one complaint no Air conditioner.",
            "The tacos here were better than some I’d had in Mexico. Cheap, authentic, delicious, busy, recommend.",
            "Great sized tacos and portions. Everyone loved their meal.  The salsa situation was better with a salsa bar, now it's okay.  Service was fast and service helpful.  United dining miles makes me eat here more often.  Reward Network location.",
            "The food is decent, reasonably priced, but the service is not particularly attentive. Overall, it's acceptable, and the experience is average. It can be a simple meal option, but there's no need to make a special trip to try it."
        ]
    },
    {
        "Name": "Al Carbon Pollos a la Brasa",
        "Rating": 4,
        "About": "602 E 4th Ave C, San Mateo",
        "Reviews": [
            "The calamari was dry and hard, and the mazamorra morada was made from a packet store bought and not made by hand, it was chunky. The tables were not cleaned, the bathroom lights were not working and they did nothing to help.",
            "So nice to have found this place, sure to return!\nThe chicken  was on point, the creams al gusto, the sides fresh, quality, and ample. The service so sweet, the atmosphere different and interesting. Fully recommend it, from someone who spent 2 weeks in LA going to 4 different 🇵🇪 Peruvian chicken  places to be greeted by average food and service.\nThe only thing I can recommend is to paint the walls inside. Gracias Al Carbon!🌈🇵🇪😘",
            "The lady who helped me was not friendly at all and I will said that she was rude. The container for to go was dirty and seemed to be reused. Food was ok but for my taste the chicken was burned. I will never come back or recommend this place.",
            "Delicious! My family is visiting from WA state, and this food was on point! Flavorful with quality ingredients and even our picky three year-old enjoyed it. My favorite is the rice.",
            "I can't believe they charger  me $14.80 for 2L inka kola because i want to drink it in the restaurant but if you want to buy the soda to go it's only for $6 .. and the reason is because they are charge you for the cup of the ice that they give you to drink it there."
        ]
    },
    {
        "Name": "Panda Express",
        "Rating": 3.9,
        "About": "1453 Burlingame Ave, Burlingame",
        "Reviews": [
            "The Panda Express in Burlingame, Ca is a very busy location. The dinning room is always clean and well maintained. This location is always fully staffed and prepared for the customers. I appreciate the consistency of the food availability and freshness as a result of the high food turnover. On the most recent visit in August 2022, a customer with 2 dogs arrived to eat in the dining room and I was not able to enjoy my meal because of barking. Other than this interruption, I like this location.",
            "Best pando express I've been too. Staff is nice and very patient and welcoming. Will definitely come back again. If you are staying in the area there is a free shuttle that picks you up for free. Hit me up if you have any questions.",
            "What a large location . Service was excellent. Soup was hot &  ok for the price",
            "Trusting neighborhood joint for tasty Chinese food craving. Reasonable priced, easy parking in the back, comfortable seating.",
            "Nice food. Some staff is friendly, but some are not friendly. Even show you a long black face. If this can be improved, it would be a good experience for me there."
        ]
    },
    {
        "Name": "Tacos Al Vapor Nueva Italia",
        "Rating": 4.3,
        "About": "602 B E 4th Ave, San Mateo",
        "Reviews": [
            "I was in love with the first bite. Their Birria tacos will keep me coming back. It was so flavorful. The people are friendly. They explained the food and made great recommendations.  The place is clean. 3 on the atmosphere only because it's not a linen type of restaurant.  I would recommend going to my friend because yummy.",
            "The food was good & service was fast. Don't expect a fancy restaurant, it's more laid back with delicious food. They serve their tacos with homemade tortillas. Will definitely be back to try the beef/goat birria they serve on weekends.",
            "Really good tacos but they don’t serve beer.\n\nMy favorite was the pollo with everything on the homemade tortillas with green sauce from the table. My husband said the lengua was super tender and tasty also with the green sauce from the table.\n\nI had carne asada and chorizo which were really good.  My husband also had carne asada and carnitas with red side from the table.\n\nVery clean.  Great service.  We will definitely be going back to try more of the items on the menu.",
            "Love getting tacos here. I haven't lived in San Mateo that long, but this has quickly become a favorite place to eat!  Thanks for the good food, clean restaurant and friendly people!",
            "Man foot was delicious, this is when some one has the  old school of cooking,. Good place to enjoy a meal,  they have a lot other dishes what I got enchiladas . Was great over all. 👏\nThanks I will be back for more is a promise.  And Course to taste other dishes too. Thanks."
        ]
    },
    {
        "Name": "Denny's",
        "Rating": 3.6,
        "About": "2920 S Norfolk St, San Mateo",
        "Reviews": [
            "Great food option, especially if you’re awake and hungry in the middle of the night.  Delicious multi-grained pancakes. Flavorful T-Bone steak & eggs. Freshly brewed coffee and friendly service. Wonderful! Thank you Seema B!",
            "Visited on a Saturday evening at sunset!  Two adults, two children.  We were accepted as relatives, served quickly, made a nice discount for children (despite the time)!  Delicious, fast, family friendly!  I recommend!  :)",
            "This locations has the best food and is very clean. I come alot and never is disappointed. Server Daniel and the cook Jefferson always makes this place my first choice after work when I'm hungry. Food is consistent and the service is consistent as well.",
            "Service was horrible.\nWe waited for 5-10 minutes to be greeted by a host. It was as if we were not standing there. I had to ask if we were to seat ourselves before anyone acknowledged us being there.\nAfter we sat down and finally placed our orders, our beverages were brought out.\nDespite us informing our server that there were drinks missing, we never received them.\nAfter waiting on our order for 30-45 minutes if not longer , we inquired on our order.\nWe were informed that our order would be out in 8 minutes.  After about 5 minutes of receiving that information we were told that our food would be out in 10 minutes.\nNeedless to say we canceled our order, paid for the drinks that we received even though we did not drink them and left the restaurant.\nNo apology from the Manager on duty.",
            "Everything is amazing! my family love this place, food is really good! and service is also really good."
        ]
    },
    {
        "Name": "Taco Bell",
        "Rating": 4,
        "About": "1975 S El Camino Real, San Mateo",
        "Reviews": [
            "My first time at a Taco Bell. Menu features both Non-veg and veg option. Ordering is via touch screen kiosks only. It seems to be relatively easy to order. The orders get filled up typically within 10 minutes or so. Our party of 4 has no difficulty finding a table. The Nacho with toppings was good. As were the chalupas and soft tacos. I may come back for breakfast just to check out what they serve.",
            "Well, since I went In and had no communication with any employees because it's just a bunch of screens that scream out welcome to the future of Taco Bell. Use the computer screen to order yourself and pay and then we will hand you your food if you can complete this task on your own. A little bit irritating. Because fast food workers are making what? $15 to $20 bucks an hour. They actually get paid to be trained for the job. So the way I see it. I spent like $25 bucks. I should receive a discount for my wage at least. So my total should have been $5 bucks. Now on the plus side by me placing my own order I didn't hear, \"We don't serve that anymore.\" and for the first time in a very long time, my order was actually correct. I think I have a real future here. Lol. I'm waiting to walk in next and have them tell me I have to cool my food as well. I just really think if you're having me do your job, Taco Bell! at least pass on. The savings and start lowering your prices to reflect that you just saved $20 bucks an hour having me check myself out. Seriously.",
            "They forgot my Large Pepsi in an Uber Eats order. The FIRST ITEM ON THE RECEIPT. 5 dollars of UE credit wont get me a new drink if I order again. Such a pain.",
            "Unfortunately, as much as I love Taco Bell I will never eat at this location again. Twice I have been served rancid food. The tortilla in the Mexican Pizza was rancid. I have actually had rancid food two other times from other Taco Bells from other items. The worst part is by the time I discover the food is rancid I'm on 15 miles away and turning back is a worse inconvenience than just tossing out the food.",
            "Taco Bell we went to had no drive-thru it was very small and when we ordered our meal which was a protein bowl we didn't get enough utensils and didn't feel like going back inside to get them because we were in a hurry there was one napkin between the two of us but the protein bowl was very good"
        ]
    },
    {
        "Name": "Heidi's Pies Restaurant",
        "Rating": 4.3,
        "About": "1941 S El Camino Real, San Mateo",
        "Reviews": [
            "Breakfast at Heidi’s Pies Restauran, American style food, was ok. We had country fried steak with sweet potatoes pancake and fish and chips.",
            "[see update below] Been going here for years if infrequently (I live on the other side of the Bay). GREAT sandwiches, HOT fries, WONDERFUL pies.   Friendly old diner atmosphere, great staff, AND FREE PARKING  - yes they have a parking lot. We split a sandwich - they served each half on separate plates with the fries, and the berry pie. Really nice filling, and the crust is crumbly delicious.\n\nSad to say they are no longer 24 hours. We just went there today by habit but got there after 5 pm and were crushed. Next time we will know better. Hopefully we can get them busy enough to extend their daytime hours into the evening on Mondays and Tuesdays.",
            "So once again we found ourselves in a tournament weekend,  our hotel offered breakfast but being that we were on a PM schedule we missed out on breakfast by sleeping in. 🤣  so we decided to venture our and find a breakfast spot. Found this place had good reviews so we decided to try it out. The place looks like a scene out of an 80s movie, but staff was very friendly and seated us immediately.  The menu was extensive a little something for every appetite.  I had the barn yard special which was a French toast meal. Good serving sizes. Did save room for pie. Let me tell you worth the pies alone. People were taking pies to go. So I will be back even if it's for a pie.",
            "My friend and I bought a APPLE PIE and added some VANILLA ICE CREAM to the pie. Extremely Delicious, highly recommend.",
            "An old style place for a cup of coffee and pie.  There were some fun choices and we chose: blueberry with sour cream, chocolate cream, boysenberry a la mode and a strawberry pie.  All were pretty tasty. The service was nice and welcoming."
        ]
    },
    {
        "Name": "Taquería las pencas #2",
        "Rating": 4.6,
        "About": "45 N B St, San Mateo",
        "Reviews": [
            "The food is good. Service too but is not a full service to your table. So, if you expect enjoy a coffee and refilled at your table is not going to happen. Because you order at front , pay and pick up your food at the front as well.\nFood is delicious and the portions are descent for the price.\nThey sell chapulines too.\nNote: no parkin.",
            "This and their South SF location are my favorite Mexican restaurants in the Bay. The food is beyond delicious, the servers go above and beyond to be helpful, and I have never had a bad experience here. They have meals you can’t find anywhere else. 100% recommend.",
            "I was extremely surprised and pleased to find authentic ‘Barbacoa Roja’ style, this is, hands down, the best barbacoa of this style I’ve had, and I am Mexican! I am sure they use pencas (Maguey Leaves) and firewood to cook it. The meat is butter-like tender and it has delicious bones with it, corn tortillas are tick and hand made. Consomé is very tasty and warm, perfect for rainy days.\n\nHorchata is the best one I have had in my life, sweet milky consistence.\n\nI didn’t take a picture of a proper taco because it was so good that I literally couldn’t stop eating. Please be aware they only have this dish on weekends.",
            "Low quality Mexican food. They use the cheap chips. Dude! At least use actual tortilla chips not the weird ones with the black dots.\nSalty food otherwise lacking flavor.",
            "in this restaurant there are very tasty dishes the menu is excellent and it offers very good service"
        ]
    }
]