[
    {
        "Name": "Original Joe’s Westlake",
        "Rating": 4.5,
        "About": "11 Glenwood Ave, Daly City",
        "Reviews": [
            "Never a bad meal here! The wait is always worth it, and is often shorter than they say it'll be.\n\nHighly recommend trying a bit of everything on the menu, everything they make is excellent and the portions are very generous. Take leftovers to save toom for dessert - a warm butter cake or brownie a la mode with a coffee is a great way to end the evening.\n\nSeasonal cocktails are always refreshing and imaginative, while still being reasonably priced.",
            "First time experience and was not disappointed! Everyone was amazing and the service was on point. Great menu and took the suggestion for the Salmon from the Hostess Riley. We sat at the counter and the Grill Chef asked if we would like it Special...Salmon was perfectly grilled and delicious. Not a place you have a quick bit but like I said, an experience",
            "What an inviting restaurant. This should be added to your list of favorite restaurants, as its setting is comfortable, spacious, amazing staff and great food. This particular location is reportedly the tenth highest net earning restaurants nationwide. Prepare yourself to wait before you get seated, because despite the restaurant being spacious, everybody loves it here. A definite must on our list.",
            "I really enjoyed my first time in this restaurant. The food was amazing. The service was impeccable, Ismael was really good, professional, and knowledgeable. I had veal milanese and my friend the salmon. I've never tried a better butter cake like the one they make.\nThe drinks are very well made as well. I will definitely come back to try some other dishes.\nRecommend.\nThe only downside is the parking. Was really difficult to find, and the French fries dry and hard.",
            "My husband and I stopped here for lunch after our Global Entry appointment at SFO. We walked in and were totally shocked by 2 things: 1) this restaurant in HUGE and 2) there was ONE table open literally right next to the kitchen and where servers prepare to-go orders.\n\nAt first, we weren’t sure about staying, but we figured if it was fully booked out on a Wednesday at lunch, it had to be good. And it was! My husband had the tuna and avocado sandwich, while I had the prime rib dip. The au jus was super flavorful and the sandwich was massive and delicious. I loved that they gave horseradish on the side so I could add my desired amount - just enough for the kick, not so much that the meat slides around😂.\n\nDefinitely make reservations and request to sit by a window. There are also some big fireplaces in this totally retro restaurant that would be great to sit near on a cold, rainy day."
        ]
    },
    {
        "Name": "Ocean Thai Restaurant",
        "Rating": 4.1,
        "About": "2545 Ocean Ave, San Francisco",
        "Reviews": [
            "Party of two. Had never tried this place before. Server was sweet and quickly sat us down. For me it was the food.\n\nThe yellow curry was good but the chicken had obviously been boiled separately (I understand) and then tossed in the curry before it was brought to us so it hadn’t absorbed any of the sauce and was bland.\n\nWhen I go for Thai, my favorite dish is the yellow curry with chicken. I also enjoy jasmine rice with this, partially because it doesn’t soak up the sauce as quickly as sticky white rice, which is great with Korean and Japanese food. Guess what rice they served? Yup, sticky white rice!\n\nThe pad Thai noodles needed more sauce when it was stir fried.\n\nI won’t be returning as there are a couple other Thai restaurants that are close by.",
            "Yellow curry was delicious. Fresh spring rolls were our favorite. I love the sauce that comes with the spring rolls.",
            "First of all, this place has such a nice and cozy atmosphere to dine in. And the food that I had, “Oh my gosh!!” It was so good and flavorful. No doubt and worries to try, I can tell ya right now. Highly recommended!!!",
            "Amazing Place. Calm atmosphere. Great food and service. Loved the Pad Thai and the yellow curry, possibly one of the best. Pricing is really reasonable. 10 min walk from SFSU.",
            "This is the BEST Thai food Ive had. My husband and I have purposely driven up to SF from Menlo Park just to eat here. This is our 3rd time dining here. My goodness. Everything is so fresh, large portions and hands down, absolutely delicious!  Full of robust thai flavor. You will not be disapppinted!!! Im so full but already looking forward to coming back again!  Tonight we had Miang Kum, Tom Kha, papaya salad and their seadfood in a clay pot. Fantastic!"
        ]
    },
    {
        "Name": "Boulevard Cafe",
        "Rating": 4.3,
        "About": "2 Poncetta Dr, Daly City",
        "Reviews": [
            "Breakfast, lunch and dinner are great. We are regular costumers. We go every other week and sometimes every week. I go with family, friends and even groups. They have accommodations for all sizes and even if you want to be by yourself it’s all good.",
            "I was passing through town and chose Boulevard Cafe because of the reviews.  I was not disappointed! I sat at the counter and thoroughly enjoyed the flatbread and a glass of wine. The sandwiches passing by also looked fantastic. Great job!",
            "Good diner food in an iconic building located right off of 280. The Denver Scramble was decent but a truly impressive portion for the cost.\n\nI’ll happily come back for breakfast again.",
            "Great food, atmosphere and service. They offer scrumptious appetizers, superb entrées including they're pasta menu and delicious drinks.",
            "The bar at the lounge has the best experience! The bartender (John) is very knowledge and has the best sense of humor. You'd never get wrong with his recommendations. I also noticed people who sat at the bar are the happiest people. Pro-tip: ask John for Ruby Rush and Pain Killer, those are now my new favorite!!!"
        ]
    },
    {
        "Name": "Little Hunan Restaurant",
        "Rating": 4.1,
        "About": "6127 Mission St, Daly City",
        "Reviews": [
            "Updated review 11/16/2023: Little Hunan has re-opened! They were closed for eight months. As a customer for over 15+ years, I was really happy to see the same people working there. Indoor dining is finally back. When I was here back in July of last year, they were to-go only. The food is still good. I got my usual beef chow fun, combo chow mein and salt and pepper deep fried spare ribs. It was awesome to taste their food again.\n\nOriginal review: Indoor dining has not re-opened. I spoke with the counter lady and they don't plan on doing it anytime soon. Tonight I tried their dinner combo A $32 for two people. It comes with a small wonton soup, egg rolls, sweet & sour pork, broccoli chicken and BBQ pork fried rice. In terms of taste, they usually nail the traditional American/Chinese dishes spot on. They have been there for decades. If there aren't that many people waiting, they are fast on the orders. In the past, I usually order their Hong Kong style pan fried noodles (they put the noodles on top of the sauce so that it doesn't get soggy when you get home), salt pepper spare ribs, salt pepper chicken wings, chow fun and other noodles. Little Hunan is solid.",
            "This is one of the best places to get salt and pepper chicken wings or salt and pepper pork chop in the bay area. They were closed for some time (6 months- year) but they're now back open which is great bc it was one of our goto weekday/weekend rotational restaurants.  We usually also get the combination fried rice and other typical dishes and it's always been togo. Highly recommend! I added the menu in my photos since they don't have one online.",
            "Go to order : Potstickers, Salt / Pepper pork chops, HK style chow mein beef, honey walnut shrimp\n\nHits every time. Must try place. Family owned.",
            "Food is good. Customer service great. Eat there often. It's in my neighborhood.",
            "Ordered BQPork but gave us egg fried over rices"
        ]
    },
    {
        "Name": "Champa Garden Restaurant",
        "Rating": 4.3,
        "About": "613 Faxon Ave, San Francisco",
        "Reviews": [
            "Very friendly service. Also appreciated that they were playing the warriors game in their bar area. There was a Laotian and Thai option for the papaya salad and I prefer the Thai version though my friends liked the shrimp paste of the Laotian. The angel wings had a good fry. The champa sampler is definitely the best item.",
            "It is one of the best restaurants in South SF. I will definitely make an effort to go back next time I'm in the Bay Area.\n\nThe foods are amazing, so fresh and delicious. Each and every dish is so good.\n\nWe had so many foods, but the stand out is the noodles.",
            "Pretty good food at this location. The Nam Kaow rice ball salad was very popular at our table. The Penang curry was also nice with sticky rice. Fried noodles (pad se-ew and pad Thai) had limp, soggy noodles and dry, dry stringy meat. Basil fried rice was not served warm. Pad ped pla dook (spicy catfish) was nice.",
            "Straightforward Lao/Thai standards (including noodle soups) served at this cozy establishment on a side street off Ocean.\n\nKao Sow noodle soup, heaping portion of noodles served in unctuous broth, with ground pork and choice of protein. Pretty good, but not the absolute best in the Bay Area.\n\nWill be back to try other dishes!",
            "Delicious Thai food, never a wait for a table. All the dishes we tried were tasty. We highly recommend the Appetizer Sampler."
        ]
    },
    {
        "Name": "Spiazzo",
        "Rating": 4.5,
        "About": "33 W Portal Ave, San Francisco",
        "Reviews": [
            "Quiet and friendly - with absolutely delicious 😋 food! We had the Pear and Gorgonzola salad and then Chicken Marsala and the Steelhead Salmon Trout. Amazing! The vegetables were perfectly cooked! We love good food. Great wine list by bottle and half bottle.",
            "The food is always seasoned to perfection, with the sides (sauteed spinach and sauteed mixed veggies) nicely complimenting the main entree. The bread is always delicately tasty. Not shown: Insalata Mista. You can't go wrong dining in or ordering takeout. Spiazzo is one of my fave places to dine and well worth the money spent!",
            "The host started the experience out with a friendly interaction. We really liked the host. It was also a beautiful day out and we were excited to enjoy some Italian cuisine. Now the review sadly is all  negative. I ordered what was the worst and most gummy Chicken Parmesan I’ve ever had. The sauce was somewhere between the liquid from a canned of crushed tomatoes and ketchup. It was particularly sad as I haven’t had a Chicken Parmesan in awhile and I was so excited. The veggies that came with the dish were either over cooked or undercooked. All a bummer. The rosé my partner ordered was a house rosé that she said tasted like boxed wine reminiscent to her Franzia college days. She ordered spaghetti vongole and while the clams were well cleaned and cooked they didn’t taste fresh and the pasta itself had no flavor. She only ate two clams with the second one being to confirm that something wasn’t right with the first one. Left a good tip because the service was good, but the food was awful. Even the bread was stale. We will not return. We did let them know about the food, and they offered to give us more bad food.\n\nUpdate: my partner ended up being sick. So that’s a positive on the clams not being quite right.",
            "Great service and very good food.  Noise level is high so beware if you're looking for something more relaxed and quiet.  Prices are extremely reasonable for the quality and quantity of food provided, making this place a great value if you're on a budget.  There is no children's menu, but do you really need one?  Pizza and pasta!  We'll be back.",
            "The service was great and I loved that he knew the menu up and down and was able to help us make a decision based on asking us questions.\n\nThe food was just as good as the service. My mom had the salmon in a lemon sauce and she said that it was the best salmon she had ever had. I had the flank steak and it was cooked perfectly. The veggies are flavorful and not over cooked, and the mashed potatoes were fluffy and flavorful.\n\nI hadn't been here since before COVID and I forgot how good Spiazzo is. You can't beat this place even at a much higher price point."
        ]
    },
    {
        "Name": "Golden Coast Restaurant",
        "Rating": 3.9,
        "About": "1540 Ocean Ave, San Francisco",
        "Reviews": [
            "Local sit down dim sum restaurant. Order from picture menu and not push carts. They give you a form to mark what you want. Quality of food is good. Freshly prepared. Pricing moderate. Service so so.",
            "I purchased the lobster 🦞 over noodles,  it cost me $23.99 plus tax.  The noodle is no taste 😔.  It is old, no sauce and taste like nothing else. The photo picture shows the noodles like stick together and very hard to eat. I can't believe that they can cook the noodles like garbage.  How can they cook like that?\nI just finished the lobster,  and I have to make a cup of noodles for myself. I will not purchase the food in this restaurant anymore.",
            "Great dishes, good portions and really attentive staff. Great place for family get togethers",
            "Ordered Curry Chicken. Decent enough... About $1-$2 overpriced for the portion of chicken vs rice given. Place could use a good scrubbing in the corners for presentation. Overall, would try again.",
            "They had really good food here! Amazed:)"
        ]
    },
    {
        "Name": "Golden China Restaurant",
        "Rating": 4.4,
        "About": "1612 Ocean Ave, San Francisco",
        "Reviews": [
            "Super authentic Chinese food, kind of reminds me of home. Owned by a lovely couple, the food never disappoints. A hidden gem in the neighborhood.",
            "It's not about the ambiance.  It's about chicken fried rice with salted fish,   snow pea leaves in garlic sauce as well as bitter melon with beef in garlic and black bean sauce.  Shrimp and vegetables with stir fried noodles is also very good.  In five months of eating here I never had anything I didn't like.  I think the same couple  have been running it for 35+ years.",
            "AMAZING FOOD WITH BIG PLATES\nI LOVE THEIR FOOD AND THE CUSTOMER SERVICE\nI WISH I HAD MORE SPACE IN MY STOMACH TO TRY MORE FOOD\nITS CLEAN NOT PRICEY AND EVERYTHING TASTED FRESH MADE",
            "While I was waiting for my first order ever, I met a woman who had been coming here since she was a child. She spoke fondly of the hot and sour soup, \"..nobody else make it like they do!' So I added it to my order and it did not disappoint! I also tried the Mongolian lamb, Sichuan eggplant, garlic spinach, and general's chicken, all were fresh and delicious and made to order! I'll definitely be back!",
            "Hands down best chinese food. My go to place whenever I'm nearby. I like vegetable fried rice and they chop up chunks of vegetables instead of the tiny diced pieces other places use. Real quality, fast and prices are fair. Best cook I've found. Gotta try it!"
        ]
    },
    {
        "Name": "Bullshead Restaurant",
        "Rating": 4.4,
        "About": "840 Ulloa St, San Francisco",
        "Reviews": [
            "The management of this restaurant has been bought from previous owner's, unfortunately its not nearly as good. Very disappointing, my grilled salmon was way over cooked & dry. My husband's burger was delicious though, We sure miss the previous Chef & the mushroom soup they use to serve. Gone are the good ole day's 😌 the minestrone soup was delicious",
            "Tasty, salty, rustic, gluten. Sensitive types avoid. They're very sweet but they just don't have a clue about keeping gluten off of a plate. I ordered and requested no gluten. There were two fries still on my plate and crumbs from somebody else's bun. Bring your gluten enzyme pills with you. It's tasty but risky. Really nice. Service, ultra casual, not fancy. Okay for a single person or a group. Take out as well. No parking. For delicate elderly's please walk them to the door and get them inside. Nobody gave my 90-year-old elderly a seat while I went to park the car. 😭 I came in to find my sweet little elderly standing. That gets hard when they're at that age. Otherwise it was a joyful meal and as I said, very tasty and high quality meats. It's a traditional neighborhood favorite. It's next to the train station so L, M, K Muni lines are there. Also, buses. Locals should walk and you can park on the outer neighborhoods for free.",
            "My first time reviewing Bullshead Restaurant but not my first time eating at this homley (British definition) environment. Upon entering you are up close and personal with the raw meat display. Behind the glassed meat display is the busy grill and grill master. If you enjoy a great smokey tasting burger then you are in for a yummy treat. The fries are exceptionally good simply because they are crunchy and medium well. The ambiance is old school and filed with sports memorabilia. I appreciate the customer service because I am chatty and they--are chatty. The salad bar is 5 stars as is the rest of the food offerings. Today I indulged in a Chocolate/Hazelnut cake and I also give it 5 stars.",
            "Love this place. They havent disappointed us with their selection of burgers. Bought my husband here, and he had the Bison burger. So juicy but didnt taste different than a beef burger.",
            "Where can you get a great sandwich with fries these days for under $10 bucks? Well, Bullshead shows how it can be done!! We both ordered the Reuben and it was superb! We also ordered sweet potato fries for an extra $1.50 and that was great. The coleslaw was only so-so perhaps because they didn’t want to use much sugar. The Reuben was perfect with great meat and filled with Swiss cheese. This is such a bargain for a wonderful lunch!!!"
        ]
    },
    {
        "Name": "Lemonade Restaurant",
        "Rating": 4,
        "About": "16 W Portal Ave, San Francisco",
        "Reviews": [
            "My recent experience at Lemonade Restaurant left much to be desired, and various factors contributed to an overall lackluster visit. The food, including the chicken breast and salmon dishes, fell short of expectations, with a notable lack of flavor and a disappointingly dry texture. It was evident that the kitchen may have overlooked crucial elements that elevate a dining experience.\n\nAdding to the disappointment was the sparse crowd; we were the only patrons at 7 pm on a Saturday night. This near-empty atmosphere was further highlighted by the visible departure of several potential diners who seemed unimpressed with the offerings. The lack of a bustling ambiance raised concerns about the restaurant's appeal and left us questioning our choice for the evening.\n\nUnfortunately, the service didn't manage to salvage the experience. The servers appeared disinterested and failed to provide the helpful and attentive service one expects in a dining setting.\n\nOn a slightly positive note, the lemonade drinks offered a modest reprieve, providing a decent refreshment. However, they were not enough to counterbalance the subpar food and lackluster service.\n\nIn conclusion, Lemonade Restaurant's underwhelming food, poor service, and a conspicuously empty dining area on a Saturday night collectively painted a picture of an establishment struggling to meet expectations.",
            "Good service. I would have to say my bowl was okay for the price which I got on special for $10. My spouse had the tuna and seem to like it. I did find it to be kind of bland and probably needed more sauce. I would come back and try other options if I'm in the area.  So on a positive note we can say it tasted very healthy and had good value.",
            "I visited earlier today and was completely disappointed. While the food was decent and the outdoor seating was lovely, the service ruined the experience. The young lady serving us had a terrible attitude and was outright rude. Not to mention, she was incredibly slow. It took 15 minutes to get our food after ordering, even though there was no one else ahead of us. On the bright side, the young man working alongside her was much better. If this place wants to stay in business, they seriously need to hire staff with better attitudes. Can't say I will be returning anytime soon.",
            "I stopped by last night in an effort to find some shelter from the rain. I was greeted by the duo working the front. They asked if I had any questions or would like to sample anything. I picked out my items and paid. Kudos to the young man who helped me out. I could tell he looked a bit tired but his smile never faded and he provided excellent service. Lovely place, amazing and genuine workers along with good food- what more could you ask for?",
            "Found this gem on my Amazon route. Ordered the ahi-poke bowl, and elder flower lemonade.  So good. So heathly tasting. Gas me the fuel to finish my route without feeling sluggish. Highly recommend.  Fresh fun atmosphere. 10/10."
        ]
    },
    {
        "Name": "J & A Restaurant",
        "Rating": 4.1,
        "About": "5712 Mission St, San Francisco",
        "Reviews": [
            "Fantastic restaurant! Definitely a mom and pop shop. Try their beef wonton soup, mongolian beef, combination chow mein, seafood combination, sweet and sour chicken, pan-fried noodles with chicken...and more! Their sauces are delicious! They use paper plates and most disposable wear lol. But the food is great and the mom/pop are super sweet. :)",
            "Not bad, the stir fried noodles tasted good and the oil didn't taste nor smell funny.\n\nI'll try other basic dishes next time before I order anything complex.",
            "Great food . Moms is cool . Been going here for over 20 years ... you won’t be disappointed.",
            "Food its simple, yet delicious. Service is fast and friendly.  You can't go wrong!",
            "Very friendly family run business. Great food and great price."
        ]
    },
    {
        "Name": "Tower Burger",
        "Rating": 4.3,
        "About": "729 Portola Dr, San Francisco",
        "Reviews": [
            "Tried this place since I was in the area. The burger 🍔 I got was bigger than I thought it would be. Toppings was pretty generous, in my opinion. I should have taken a picture of the item to show the size of the item. I didn't dine in as my order was take-out, so I'm not able to comment about the atmosphere",
            "The burger and sweet potato fries were good! It's a bit too pricy for regular lunches but great for a treat once in a while! It's nice that there's a discount for sides purchased with a burger.\n\nOne of their lady staff seemed really kind - I felt it even though I only had a short interaction.",
            "Mom & Pop place.  Good basic food.  Easy parking.  My fish & chips were fried at the right temperature and not soggy like some do. Very affordable at $13.  Comes with fries.",
            "Great burgers, cooked to order by a friendly cook.  Nice courteous owner & staff.  I love the quality of their meat & bread.  The fries are crunchy.  I love the chili cheese fries.  Tasty milk shakes.  Very clean restaurant and men's room.  Fresh vegetables on my burger!  They'll give you ketchup and mustard packets to go & plastic ware, if you ask.  In 1/19 I asked the owner's son if they sold their tee-shirts.  That would be free advertising for them.  He said no, but I will ask the owner.  I like wearing tee-shirts with local stores or brands as long as they include, \"San Francisco, CA.\" on them.  I went the other day, as I go regularly.  I bought the Phili Cheese Steak.  Wow!  I loved it!  I always love the chili cheese fries, which I buy as a half order, since I'm dieting.",
            "Great place, Im a regular, I live less than a mile from the place. The fries are always good,the fish is very good, burgers very good, I get the chicken mushroom grilled sandwich often, very good. The prices are also very reasonable, on the lower end. Great 👍"
        ]
    },
    {
        "Name": "Pacific Restaurant",
        "Rating": 4.1,
        "About": "6356 Mission St, Daly City",
        "Reviews": [
            "Been going to this place like 20 years + and it never disappoints ! Always good , tasty and fresh and people are friendly. 5 stars def!",
            "Local go to Chinese spot. The food is always flavorful and consistent. They currently are not offering a dine in options. And pre-covid they used to have a lunch buffet. My kids really miss that. Check out my IG page for more pictures. @foodie_wit_a_bootie_408",
            "I went to the buffet around 12:45 pm I usually go all the time when I go to San Francisco but the last 2 times service and food been terrible. Especially when I ask if she going to fill it up the containers and she said ( Yes) But she brought a little bowl and I didn't see she fill the shrimp container and I ask her if they going to bring more shrimp she said next time come early cause we close the buffet at 2:00pm and was only 1:00pm .",
            "Decent lunch buffet. Only 8 dishes and a soup but every item is decent to good. For $11 a person, this AYCE is worth trying. My favorite was the egg roll but by 1:15 they ran out of that item and didn't restock.",
            "Not the greatest tasting Chinese food I’ve had. Disappointed in with the Kung Pao especially."
        ]
    },
    {
        "Name": "House Of Fusion",
        "Rating": 3.9,
        "About": "6288 Mission St, Daly City",
        "Reviews": [
            "Great did,  generally excellent service.\n\nBut peon sizes are getting skimpy for the price ($16 for an Alaskan Roll only 6 medallions)\n\nThey just lost a regular customer,  that orders 1-2x per week @ $50 a pop.",
            "Omg the food was so good! it is so hard to find really good delivered tempura but I finally have! Not only is there food amazing but their customer service is equally amazing, very friendly and accommodating!! I'm almost always disappointed and food I get delivered for one reason or another like temp, flavor, missed items etc but not here all 10 stars across the board for every item!! we had the Chicken Teriyaki Lunch Bento  and Salmon Teriyaki Lunch Bento  with California rolls and  Tempura Appetizer. If I could give them all 10 stars I absolutely would and 15 for customer service!!",
            "The fried rice, sushi and other items are delicious. The shrimp fried rice was very delicious highly recommend. Great authentic Chinese and Japanese cross.",
            "The lady in the front taking orders is super nice and very good customer service very friendly!",
            "Great place for getting some bento 🍱 and sushi, rolls, potato\ncroquettes… 🤤"
        ]
    },
    {
        "Name": "Maple SF Restaurant",
        "Rating": 4.2,
        "About": "5820 Mission St, San Francisco",
        "Reviews": [
            "This is the Chinese restaurant of choice for my partner and me, whether takeout or dine-in, they give big portions, and inflation didn't hit too hard here compared to other Chinese restaurants that my family (Chinese-American) used to eat at, so it is more affordable here but still great quality authentic SF-Chinese-American. I'd recommend the Tomato Beef Chow Mein, which is basically how I judge Chinese restaurants in SF (it's historically an SF Chinese-American specialty). You can request thin crispy pan fried noodles for it too, which is my favorite variation. We also really loved the orange chicken, very tasty. We only dined in once, which was our first time, but the waiter was a polite young man.",
            "I ordered the Walnut Shrimp Rice plate, the Spareribs and Bitter Melon Rice plate, and the chicken feet. The food tasted ok and average. Bitter melon was a little old. And the rice was old. The chicken feet was good. The biggest disappointment was the Walnut Shrimp Rice Plate. It had VERY little Shrimp and mostly rice. Felt it was a rip off for $12.90 per plate.",
            "During the pandemic, they were open for take-out. I remember looking for food and was happy to find them. The food was OK back then and it is the same now. By no means are they fancy. This time around, their dining room has reopened. I still did take-out though for some BBQ pork wonton noodles $12.50. The BBQ pork was really chewy and the eight wontons were OK. I don't really like thick noodles with soup. I would rank their broth as nothing special. It was an OK meal.",
            "Very nice. Very clean, cozy, and good menu. I like the tables and chairs, so comfortable. I’m coming here again for sure. Thank you.",
            "The taste of \"Hakka steamed tofu\" and \"lamb belly pot\" in this restaurant is truly unique. For your taste buds, it's definitely amusing! What a hidden treasure!"
        ]
    },
    {
        "Name": "Spicy House 川香小館",
        "Rating": 4.5,
        "About": "6811 Mission St, Daly City",
        "Reviews": [
            "Staple spot for Szechuan dishes at reasonable prices. Loved the Dan Dan Noodles! The Spicy Beef Noodle Soup was a little light on the beef but delicious overall. Although I live over 45 minutes away, I will definitely find a way to return soon!",
            "An absolute treasure! This Chinese restaurant offers delicious, authentic cuisine at great prices. The staff is incredibly welcoming, and every dish is bursting with fresh, flavorful ingredients. Highly recommended for an exceptional dining experience.",
            "We love unpretentious and generous portion and flavor of the food here. Everything we tried is delicious and big. The highlight for us is the boiled beef in the chili sauce but there are many more to explore. We are determined to eat here again. FYI, it is close to many grocery stores so it is a great trip to buy grocery and have great cooked meal here at the same time.",
            "The house fried rice was delicious with the exception of the unseasoned beef.\nThe salt and pepper chicken had no salt and although there were mostly onions and jalapenos, it did not really have a peppery taste.",
            "Amazing food. Authentic chinese cuisine. Really liked the flavour and spice of all the dishes we ordered. Hunan Chicken and Spicy Seafood Soup were our favorites. Surprisingly the quantity of food was very reasonable to the cost of the item.\nWould definitely visit the place again"
        ]
    },
    {
        "Name": "Tsing's Chinese Restaurant",
        "Rating": 3.8,
        "About": "361 W Portal Ave, San Francisco",
        "Reviews": [
            "Stumbled into this place on my Amazon route. Wasn't disappointed. Food and service were excellent.  Will eat here again. Definitely! Highly recommend  the shrimp and pork dumplings.  Dim sum! 🥡🥠🥟♨️",
            "Excellent Dinner Lemon Chicken 1 time.  Much better than other Chinese restaurants.  Lightly battered crispie coated succulant white meat chicken.   Great white rice 1 time.  Super hot & sour soup.  Polite service 1 time.  Clean restaurant and bathroom.  Superb value!  The dinner version IS different than the lunch version.  I'm back for lunch & my favorite dish.  Started with tasty hot & sour soup.  The lunch lemon chicken is not as good as the dinner version, now ×2.  I went back 2 more times for the lemon chicken.  Both times were a let down.  The last time the waiter was rude & not at all friendly.  No soup.  No tea.  The rice was extra $!  With poor service & mediocre lemon chicken, I have decided never to go there again.  I spend my $$ at places that appreciate my business & my $$.  Poor service & not great food = good bye Felicia!",
            "Really not great food. I order orange (flavored) chicken and sweet and sour pork and neither had any sweetness or resemblance to the expected dish. Next time I will check these reviews before ordering. The seamless app rated high",
            "We've eaten here many times over the years.  Best fried rice around. The lunch special is a good value for the money.\nWe've always gotten good service.\n\nMy only complaint, the honey walnut prauns used to be my favorite, but the last few years it's been awful.  But everything else has been good.",
            "Order from this place a little while ago, got two lunch specials, and while the price was nice the food was not so good.\n\nThe salt and pepper tofu was bland, and cold in the middle. Almost flavorless.\n\nThe orange chicken was cooked well and the chicken itself was pretty nice but the sauce was lacking in taste and quantity.\n\nHad a few pieces with no sauce at all, and when there was sauce it was really salty and not at all sweet. Not exactly what I was expecting. But still alright.\n\nAlso the food came cold, which kind of ruined it but could've been a delivery thing.\n\nEither way, it's alright. Probably wouldn't return by choice, but if I lived near by I might grab it once in awhile."
        ]
    },
    {
        "Name": "Franco's Latin Table",
        "Rating": 4.4,
        "About": "24 W Portal Ave, San Francisco",
        "Reviews": [
            "The food was very tasty and the portion sizes aren't too small! I hear it gets busy for dinner, but it wasn't too busy at lunchtime.\nWe got:\nTacos Birria- Absolutely to die for. The braised meat was so tender and juicy\nPupusas- Very good, not too greasy, and the pickled veggies were fresh and crunchy\nFried plantains- cooked well, not too greasy or soggy",
            "Great little spot to have a delicious meal! The atmosphere is pleasant, the service is fast and friendly and the food was mouth watering. Really cute date spot too!",
            "Service can be slow when busy, but very friendly. Nice place for a date night, and the food is always delicious.",
            "What a surprise!   I never knew that this restaurant existed!   Ive been eating on West Portal for 15 years and going to Peets (3 doors down) and the hardware store since .... 2002?  I never saw this place.\n\nWell, my wife was in the mood for Peruvian food.  I suppose it's because we just returned from Machu Picchu a few months ago.  I was like..... \"where are we going?\"\n\nI didn't know what to expect nor was I expecting much when I arrived.  After all, just a few months ago I was eating amazing Peruvian food.\n\nI was surprised at the quality of the food.  Not only was it delicious, but it was presented beautifully.\n\nThe restaurant is very nice and clean.  The staff is professional and courteous.  It was the perfect evening.",
            "Outdoor seating, great service and delicious food. I’ve been here twice, one for brunch and once for dinner. I had the pork, my friend had the beef and it was on point! Cocktails are nice with a good kick, quick and efficient. A good mix of Latin food, come try out all the different items and support local small business and restaurants!"
        ]
    },
    {
        "Name": "Big Baba Eats",
        "Rating": 4.7,
        "About": "198 Broad St, San Francisco",
        "Reviews": [
            "This is a local neighborhood hole in the wall. Been coming here since the past owners were putting together the great sandwiches. Now that it’s renovated their menu expanded with a full kitchen. Everything is fresh at a fair price. And the staffs are very friendly and understanding.",
            "The location of this store is in a neighborhood that seems deserted. The store sells fun, customized cocktails in plastic containers. We ordered garlic fries and a grilled chicken sandwich. The sandwich was mammoth and fresh but lacked flavor. People in the store were friendly and we were given a plastic tumbler with ice for the cocktail.",
            "The person behind the register who took photos of us was really nice.\nThe 21+ drink bags were really good. A a cup of ice and straw were given for free which is a nice touch.\nThe store had so much variety of drinks and snacks. The food looked really good and although I didn't try it the first time I went next time I'm in town I'll order something.\nWe parked a block away parking was a bit tough.\nOne of the nicest not so little family markets I've been to. Can't wait to return next time in in SF.",
            "Burger was just ok, they forgot the additional avocado request. The Mediterranean plate we got was delicious though, good flavor! Presumed store owner was not friendly and seemed grumpy.",
            "Big Baba Eats is so underrated. I’ve ordered from here many times. The burgers and sandwiches are excellent (frequently ordered) and everything I’ve had; shawarma and burritos (less often), are good too. I’ve never actually been to the site, always delivery, but if it’s located in a store then don’t judge a book by its cover!"
        ]
    },
    {
        "Name": "Tasty Pot",
        "Rating": 4,
        "About": "215 Lake Merced Blvd, Daly City",
        "Reviews": [
            "*11/8/2023\nOn a chilly day, my craving for something spicy led me to Tasty Pot, where I ordered the Sichuan Flavor Hot Soup. It comes with napa, beef slices, fish fillet, clam, aorta, imitation crabmeat, tempura, fishball, beef ball, zucchini, enoki mushroom, black mushroom, potato slices, frozen tofu, fried tofu puff, fried tofu skin, potato, noodle, and scallion.\n\nThe soup itself tasted pretty decent and did an excellent job of warming up my body in the cold weather. What made the experience even better was that I had enough soup left to take home and turn into my own noodle soup for another meal. The flavors held up beautifully, and it felt like getting two delicious meals for the price of one.\n\nA pro tip for those planning to visit Tasty Pot: There's a convenient parking garage right next to the restaurant, making your dining experience even more hassle-free.\n\n7/7/2023\nI recently tried the Sichuan Flavor Hot Soup at Tasty Pot in Daly City, and overall, the experience was decent. The soup contained a variety of ingredients, including napa, beef slices, fish fillet, clam, aorta, imitation crabmeat, tempura, fishball, beef ball, zucchini, enoki mushroom, black mushroom, potato slices, frozen tofu, fried tofu puff, fried tofu skin, potato, noodle, and scallion.\n\nWhile everything tasted okay, I was disappointed with the Sichuan flavor. As someone who enjoys spicy food, I specifically requested the extreme spicy option. However, the broth failed to deliver the desired level of spiciness and the characteristic numbing sensation that is expected from Sichuan cuisine. It would have been more enjoyable if the broth had packed a stronger punch in terms of spice.\n\nDespite this drawback, the overall taste of the ingredients was satisfactory. The variety of items included in the soup created a diverse and enjoyable combination of flavors. However, I believe that focusing on improving the authenticity and intensity of the Sichuan flavor would greatly enhance the dining experience.",
            "Food was decent, good value I guess. I got the herbal pot and enjoyed it but food quality was questionable as I felt really bloated afterwards and the leftovers gave me a bad stomachache 😢\nYou also have to keep stirring small pot to ensure things are cooked/flavored by the soup.\nI’d go to Tasty Pot again but not at this location.",
            "Good bowl of hot soup with noodles.\nOrder from phone after scanning QR code. Service is average, since they don't take your order.  Just bring your food when ready, no beverage refill, and bring your bill at the end.  Make sure you submit your order at the end.",
            "Their little pre-assembled hot pots are OK. It looks nothing like their marketing photos though. I had the #12, seafood hot pot $22 and added meatballs $4. I kept the default setting when ordering on the QR coded website, which was no spicy and pork soup. The food tasted fine. The side of meatballs were still frozen inside and I had to leave it in the hot soup for a while. After a few bites, I should have ordered it with some spice. They only have hot sauce and soy sauce as condiments at the table. I asked the waiter for some hoisin sauce for the seafood but they don't have it. I also asked for maybe some peanut sauce or sesame oil or ginger but they also don't have that either. What?! A hot pot restaurant without sauces. It is kind of ridiculous. Service was fine.",
            "The biggest thing that surprised me how FAST they got out our orders. They have a system that you scan the QR code on thr table and order your food from there. The hotpot itself was really tasty, but they didn't really give much meat or veggies even if you ordered extra. But if this is your first hotpot experience, it's not that big of a deal.  If you're used to hot pot you may be a bit disappointed with portion size.\nI got the lamb pot and it was really good!"
        ]
    }
]